using BatchAndReport.DAO;
using BatchAndReport.Entities;
using BatchAndReport.Models;
using BatchAndReport.Services;
using DinkToPdf;
using DinkToPdf.Contracts;
using DocumentFormat.OpenXml;
using DocumentFormat.OpenXml.Packaging;
using DocumentFormat.OpenXml.Wordprocessing;
using iText.Layout.Element;
using Microsoft.AspNetCore.Mvc;
using Spire.Doc.Documents;
using System.Text;
using System.Threading.Tasks;


public class WordEContract_BuyAgreeProgram
{
    private readonly WordServiceSetting _w;
    private readonly Econtract_Report_SLADAO _e;
    private readonly IConverter _pdfConverter; // เพิ่ม DI สำหรับ PDF Converter
    private readonly EContractDAO _eContractDAO;
    private readonly E_ContractReportDAO _eContractReportDAO;
    public WordEContract_BuyAgreeProgram(WordServiceSetting ws
        
        , Econtract_Report_SLADAO e
        , IConverter pdfConverter
        ,
EContractDAO eContractDAO
        , E_ContractReportDAO eContractReportDAO
        )
    {
        _w = ws;
        _e = e;
        _pdfConverter = pdfConverter;
        _eContractDAO = eContractDAO;
        _eContractReportDAO = eContractReportDAO;
    }
    #region 4.1.1.2.10.สัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ ร.308-60
    public async Task<byte[]> OnGetWordContact_BuyAgreeProgram(string id)
    {
        try
        {

        }
        catch (Exception ex)
        {
        
        }
        var result = await _e.GetSLAAsync(id);
        if (result == null)
        {
            throw new Exception("SLA 308-60 data not found.");
        }
        else 
        {
            var stream = new MemoryStream();

            using (var wordDoc = WordprocessingDocument.Create(stream, DocumentFormat.OpenXml.WordprocessingDocumentType.Document, true))
            {
                var mainPart = wordDoc.AddMainDocumentPart();
                mainPart.Document = new DocumentFormat.OpenXml.Wordprocessing.Document();

                // Styles
                var stylePart = mainPart.AddNewPart<StyleDefinitionsPart>();
                stylePart.Styles = WordServiceSetting.CreateDefaultStyles();

                var body = mainPart.Document.AppendChild(new Body());

                body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("แบบสัญญา", "000000", "36"));
                body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("สัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์", "000000", "36"));
                // 2. Document title and subtitle
                body.AppendChild(WordServiceSetting.EmptyParagraph());
                body.AppendChild(WordServiceSetting.RightParagraph("สัญญาเลขที่…" + result.Contract_Number + "."));


                // With this:
                string datestring = CommonDAO.ToThaiDateStringCovert(result.ContractSignDate ?? DateTime.Now);
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("สัญญาฉบับนี้ทำขึ้น ณ สำนักงานส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อม (สสว.)\r\n"
                    + "ตำบล/แขวง ทุ่งสองห้อง อำเภอ/เขต หลักสี่\r\n" +
                "จังหวัด กรุงเทพ เมื่อ" + datestring + "\r\n" +
                "ระหว่าง " + result.Contract_Organization + "\r\n" +
                "โดย " + result.SignatoryName + "\r\n" +
                "ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ซื้อ” ฝ่ายหนึ่ง กับ…" + result.ContractorName + "", null, "32"));

                // นิติบุคคล
                if (result.ContractorType == "นิติบุคคล")
                {
                    body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ซึ่งจดทะเบียนเป็นนิติบุคคล ณ " + result.ContractorName + " มี\r\n" +
                 "สำนักงานใหญ่อยู่เลขที่ " + result.ContractorAddressNo + "ถนน " + result.ContractorStreet + " ตำบล/แขวง " + result.ContractorSubDistrict + "\r\n" +
                 "อำเภอ/เขต " + result.ContractorDistrict + " จังหวัด " + result.ContractorProvince + " \r\nโดย " + result.ContractorSignatoryName + "" +
                 "มีอำนาจลงนามผูกพันนิติบุคคลปรากฏตามหนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท ……………\r\n" +
                 "ลงวันที่ " + CommonDAO.ToThaiDateStringCovert(result.ContractSignDate ?? DateTime.Now) + "  (5)(และหนังสือมอบอำนาจลง " + CommonDAO.ToThaiDateStringCovert(result.ContractSignDate ?? DateTime.Now) + ") แนบท้ายสัญญานี้\r\n"
               , null, "32"));
                }
                else
                {
                    //บุคคลธรรมดา
                    body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(6)(ในกรณีที่ผู้รับจ้างเป็นบุคคลธรรมดาให้ใช้ข้อความว่า กับ " + result.ContractorName + "\r\n" +
                      "อยู่บ้านเลขที่ " + result.ContractorAddressNo + "ถนน " + result.ContractorStreet + " ตำบล/แขวง " + result.ContractorSubDistrict + "\r\n" +
                    "อำเภอ/เขต " + result.ContractorDistrict + " จังหวัด " + result.ContractorProvince + " \r\n" +
                    " ผู้ถือบัตรประจำตัวประชาชนเลขที่ " + result.CitizenId + " ดังปรากฏตามสำเนาบัตรประจำตัวประชาชนแนบท้ายสัญญานี้) ซึ่งต่อไปใน\r\n" +
                    "สัญญานี้เรียกว่า “ผู้ให้เช่า” อีกฝ่ายหนึ่ง", null, "32"));

                }


                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ 1 คำนิยาม", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("“โปรแกรมคอมพิวเตอร์” หมายความว่า คำสั่ง ชุดคำสั่งหรือสิ่งอื่นใดที่นำไปใช้กับเครื่องคอมพิวเตอร์ เพื่อให้เครื่องคอมพิวเตอร์ทำงานหรือเพื่อให้ได้รับผลอย่างหนึ่งอย่างใด ทั้งนี้ ไม่ว่าจะเป็นภาษาโปรแกรมคอมพิวเตอร์ในลักษณะใดที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("“สื่อ” หมายความว่า วัตถุซึ่งมีโปรแกรมคอมพิวเตอร์บันทึกอยู่", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๒ ข้อตกลงซื้อขายและอนุญาตให้ใช้สิทธิ", null, "32", true));
                string strTotalAmount = CommonDAO.NumberToThaiText(result.TotalAmount ?? 0);
                string strVatAmount = CommonDAO.NumberToThaiText(result.TotalAmount ?? 0);
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ซื้อตกลงซื้อ และผู้ขายตกลงขาย และอนุญาตให้ใช้สิทธิโปรแกรมคอมพิวเตอร์ พร้อมด้วยสื่อและคู่มือการใช้โปรแกรมคอมพิวเตอร์ เป็นราคาทั้งสิ้น "+result.TotalAmount+" บาท ("+ strTotalAmount + ") ซึ่งเป็นราคาที่" +
                    "ได้รวมภาษีมูลค่าเพิ่มจำนวน "+result.VatAmount+" บาท ("+ strVatAmount + ") ตลอดจนภาษีอากรอื่น ๆ และค่าใช้จ่ายทั้งปวงด้วยแล้ว รายละเอียดโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิเป็นไปตามเอกสารแนบท้ายสัญญาผนวก ๑", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๓การรับรองและการอนุญาตให้ใช้สิทธิ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๑ ผู้ขายรับรองและยืนยันว่าผู้ขายเป็นเจ้าของลิขสิทธิ์ รวมถึงสิทธิในทรัพย์สินทางปัญญาอื่นใด และมีสิทธิแต่ผู้เดียวอย่างสมบูรณ์โดยปราศจากภาระผูกพันใดๆ อันจะทำให้เสื่อมสิทธิในโปรแกรมคอมพิวเตอร์หรือคู่มือการใช้หรือสิ่งอื่นใดที่เกี่ยวข้องกับโปรแกรมคอมพิวเตอร์ และ/หรือผู้ขายรับรองและยืนยันว่ามีอำนาจในการอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ คู่มือการใช้หรือสิ่งอื่นใดที่เกี่ยวข้องกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้โดยชอบด้วยกฎหมาย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๒ ผู้ขายตกลงอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ในหลายลักษณะหรือลักษณะใดลักษณะหนึ่งเพียงลักษณะเดียวดังนี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์หนึ่งชุดกับเครื่องคอมพิวเตอร์เครื่องใดเครื่องหนึ่ง (Single License) โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ในขณะเดียวกันไม่เกิน….……..(…….…...) คน", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ที่บรรจุโปรแกรมคอมพิวเตอร์ จำนวน….……………....(………..…………..) เครื่อง (Volume License) โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ที่บรรจุในเครื่องคอมพิวเตอร์แต่ละเครื่องในขณะเดียวกันไม่เกิน….……..…...(…………..……..) คน", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์หลักในระบบเครือข่ายเพื่อทำให้เครื่องคอมพิวเตอร์ จำนวน….……..…...(…………..…………..) เครื่อง สามารถใช้โปรแกรมคอมพิวเตอร์ได้ ในขณะเดียวกัน (Network License)", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ของผู้ซื้อได้ โดยไม่จำกัดจำนวน ในขณะเดียวกัน (Corporate License)", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๗) ๓.๓ กำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ เริ่มต้นตั้งแต่วันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วน และสิ้นสุดวันที่ "+result.SWExpiry_Date+" รวมเป็นเวลา "+result.TotalYears+" ปี "+result.TotalMonths+" เดือน "+result.TotalDays+" วัน", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๔ ในกรณีที่ผู้ขายเป็นผู้มีอำนาจอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ผู้ขายได้นำเอกสารหลักฐานเกี่ยวกับการเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ดังกล่าว ซึ่งออกโดยเจ้าของลิขสิทธิ์ มามอบให้แก่ผู้ซื้อในขณะลงนามในสัญญานี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เอกสารหลักฐานที่แสดงว่าผู้ขายเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ ซึ่งผู้ขายจะต้องนำมามอบให้แก่ผู้ซื้อตามวรรคหนึ่ง จะต้องมีข้อความที่แสดงให้เห็นว่า ในกรณีที่ผู้ขายเลิกกิจการหรือถูกเพิกถอนการอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้จากเจ้าของลิขสิทธิ์ เจ้าของลิขสิทธิ์จะยอมผูกพันตามสัญญานี้แทนผู้ขายหรือจัดให้ผู้มีอำนาจอนุญาต       ให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์รายอื่นผูกพันตามสัญญานี้แทนผู้ขาย และอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ โดยผู้ซื้อไม่ต้องเสียค่าใช้จ่ายใดๆ ทั้งสิ้น", null, "32"));


                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๔เอกสารอันเป็นส่วนหนึ่งของสัญญา", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เอกสารแนบท้ายสัญญาดังต่อไปนี้ ให้ถือเป็นส่วนหนึ่งของสัญญานี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๑ ผนวก ๑ …(รายละเอียดและราคาโปรแกรมคอมพิวเตอร์ที่ซื้อขาย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs(" และการอนุญาตให้ใช้สิทธิพร้อมสื่อและคู่มือ)... จำนวน......(......) หน้า", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๒ ผนวก ๒ ...(รายการคุณลักษณะเฉพาะ)...จำนวน......(......) หน้า", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๓ ผนวก ๓ … (รายละเอียดการทดสอบการใช้งานโปรแกรมคอมพิวเตอร์)...จำนวน......(......) หน้า", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๔ ผนวก ๔ ...(การอบรมการใช้งานโปรแกรมคอมพิวเตอร์)...จำนวน......(......) หน้า", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๕ ผนวก ๕ …(รายละเอียดการให้บริการหลังการขาย)...จำนวน......(......) หน้า", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๖ ผนวก ๖ …(รายละเอียดการแก้ไขพัฒนาโปรแกรมคอมพิวเตอร์ให้ดีขึ้น)...จำนวน......(......) หน้า", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ความใดในเอกสารแนบท้ายสัญญาที่ขัดหรือแย้งกับข้อความในสัญญานี้ ให้ใช้ข้อความในสัญญานี้บังคับ และในกรณีที่เอกสารแนบท้ายสัญญาขัดแย้งกันเอง ผู้ขายจะต้องปฏิบัติตามคำวินิจฉัยของผู้ซื้อ คำวินิจฉัยของผู้ซื้อให้ถือเป็นที่สุด และผู้ขายไม่มีสิทธิเรียกร้องราคา ค่าเสียหาย หรือค่าใช้จ่ายใดๆ เพิ่มเติมจากผู้ซื้อทั้งสิ้น", null, "32"));


                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๕การส่งมอบ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายจะต้องส่งมอบและติดตั้งโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้ให้มีคุณสมบัติถูกต้องและครบถ้วนตามที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ โดยให้พร้อมใช้งานได้ตามรายละเอียดการทดสอบที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๓ ให้แก่ผู้ซื้อ ณ  "+result.DeliveryLocation+" ภายใน… "+result.DeliveryDateIn+" วัน นับถัดจากวันลงนามในสัญญา", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีผู้ขายประสงค์จะนำโปรแกรมคอมพิวเตอร์รายการใดที่ต่างไปจากรายละเอียด ที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ มาส่งมอบและติดตั้งให้ผู้ซื้อ ผู้ขายต้องได้รับความยินยอมเป็นหนังสือจากผู้ซื้อก่อน และโปรแกรมคอมพิวเตอร์ที่จะนำมาส่งมอบดังกล่าวนั้นจะต้องมีคุณสมบัติไม่ต่ำกว่าที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การส่งมอบโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ไม่ว่าจะเป็นการส่งมอบเพียงครั้งเดียว หรือส่งมอบหลายครั้ง ผู้ขายจะต้องแจ้งกำหนดเวลาส่งมอบแต่ละครั้งโดยทำเป็นหนังสือยื่นต่อผู้ซื้อ ณ "+result.NotiLocation+" ในวันและเวลาทำการของผู้ซื้อ ก่อนวันส่งมอบไม่น้อยกว่า "+result.DeliveryDateIn+" วันทำการของผู้ซื้อ", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๖การตรวจรับ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อผู้ซื้อได้ตรวจรับโปรแกรมคอมพิวเตอร์ที่ส่งมอบและเห็นว่าถูกต้องครบถ้วน ตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ แนบท้ายสัญญานี้และเงื่อนไขต่างๆ ของสัญญานี้แล้ว ผู้ซื้อจะออกหนังสือแสดงการรับมอบโปรแกรมคอมพิวเตอร์เพื่อผู้ขายใช้เป็นหลักฐานประกอบการขอรับชำระราคาค่าโปรแกรมคอมพิวเตอร์", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผลการตรวจรับปรากฏว่า โปรแกรมคอมพิวเตอร์ที่ผู้ขายส่งมอบไม่ถูกต้องครบถ้วนหรือไม่ตรงตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์แนบท้ายสัญญานี้ และเงื่อนไขต่างๆ ของสัญญานี้ หรือใช้งานได้ไม่ถูกต้องครบถ้วนตามข้อ ๕ ผู้ซื้อทรงไว้ซึ่งสิทธิที่จะไม่รับโปรแกรมคอมพิวเตอร์นั้น ในกรณีเช่นว่านี้ ผู้ขายต้องนำโปรแกรมคอมพิวเตอร์นั้นกลับคืนโดยเร็วที่สุดเท่าที่จะทำได้และนำโปรแกรมคอมพิวเตอร์ใหม่มาส่งมอบให้แก่ผู้ซื้อ หรือต้องทำการแก้ไขให้ถูกต้องตามสัญญาด้วยค่าใช้จ่ายของผู้ขายเอง และระยะเวลาที่เสียไปเพราะเหตุดังกล่าว ผู้ขายจะนำมาอ้างเป็นเหตุขอขยายเวลาตามสัญญาหรือของดหรือลดค่าปรับไม่ได้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑๐) ในกรณีที่ผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ไม่ครบถ้วนหรือส่งมอบครบถ้วน แต่ใช้งานได้ไม่ถูกต้องตามที่กำหนดไว้ในข้อ ๕ แต่ไม่ถึงกับทำให้ระบบคอมพิวเตอร์ทั้งหมดใช้การไม่ได้ ผู้ซื้อจะตรวจรับโปรแกรมคอมพิวเตอร์เฉพาะส่วนที่ใช้งานได้ถูกต้องครบถ้วน โดยออกหนังสือแสดงการรับมอบโปรแกรมคอมพิวเตอร์เฉพาะส่วนนั้นก็ได้ ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การตรวจรับจะสมบูรณ์ตามสัญญานี้ก็ต่อเมื่อผู้ซื้อได้ทดสอบโปรแกรมคอมพิวเตอร์ ว่าสามารถปฏิบัติงานได้เต็มความประสงค์ของผู้ซื้ออย่างถูกต้องครบถ้วน", null, "32"));


                var slaInstall = await _e.GetSLAInstallmentAsync(id);
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๗การชำระเงิน ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑๑) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย เมื่อผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วนตามข้อ ๖ และผู้ขายได้อบรมเจ้าหน้าที่ของผู้ซื้อตามข้อ ๑๑ เสร็จสิ้นแล้ว ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑๒) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย เป็นงวดๆ รวม "+ slaInstall.ToList().Count + " งวด ดังนี้ ", null, "32"));
           
                

                if (slaInstall != null) 
                {
                    foreach (var item in slaInstall)
                    {
                        body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("งวดที่หนึ่งเป็นเงิน " + item.TotalAmount + " บาท (" + CommonDAO.NumberToThaiText(item.TotalAmount ?? 0) + ") จะจ่ายให้เมื่อผู้ซื้อได้ใช้โปรแกรมคอมพิวเตอร์เป็นเวลา " + item.UseMonth + " เดือน", null, "32"));

                        // last loop
                        if (item == slaInstall.Last())
                        {
                            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("งวดสุดท้ายเป็นเงิน " + item.TotalAmount + " บาท (" + CommonDAO.NumberToThaiText(item.TotalAmount ?? 0) + ") จะจ่ายให้เมื่อครบกำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ดังกล่าว", null, "32"));
                        }
                    }
                }
                

                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในระหว่างงวดหนึ่งงวดใด หากผู้ขายเลิกกิจการ หรือถูกเพิกถอนการเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ผู้ซื้อจะชำระเงินค่าโปรแกรมคอมพิวเตอร์ที่ถึงกำหนดชำระในวันหรือหลังจากวันที่ผู้ซื้อได้ทราบถึงเหตุดังกล่าวให้แก่เจ้าของลิขสิทธิ์รายใหม่ หรือผู้มีอำนาจอนุญาตให้ผู้อื่นใช้สิทธิในโปรแกรมคอมพิวเตอร์รายอื่นซึ่งเจ้าของลิขสิทธิ์จัดให้มาผูกพันตามสัญญานี้ แล้วแต่กรณีแทน ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การจ่ายเงินตามเงื่อนไขแห่งสัญญานี้ ผู้ซื้อจะโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขาย ชื่อธนาคาร "+result.SaleBankName+" สาขา "+result.SaleBankBranch+"  ชื่อบัญชี "+result.SaleBankAccountName+" เลขที่บัญชี "+result.SaleBankAccountNumber+" ทั้งนี้ผู้ขายตกลงเป็นผู้รับภาระเงินค่าธรรมเนียม หรือค่าบริการอื่นใดเกี่ยวกับการโอน รวมทั้งค่าใช้จ่ายอื่นใด (ถ้ามี) ที่ธนาคารเรียกเก็บและยินยอมให้มีการหักเงินดังกล่าวจากจำนวนเงินโอนในงวดนั้นๆ (ความในวรรคนี้ใช้สำหรับกรณีที่หน่วยงานของรัฐจะจ่ายเงินตรงแก่ผู้ขาย (ระบบ Direct Payment) โดยการโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขายตามแนวทางที่กระทรวงการคลังหรือหน่วยงานของรัฐเจ้าของงบประมาณเป็นผู้กำหนดแล้วแต่กรณี)", null, "32"));


                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๘ สิทธิของผู้ซื้อ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๑ ผู้ซื้อมีสิทธิที่จะใช้โปรแกรมคอมพิวเตอร์และคู่มือสำหรับผู้ใช้โปรแกรมคอมพิวเตอร์ตามสัญญานี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๒ ผู้ซื้อขอรับรองว่าจะไม่ลบ ทำลาย ทำให้เสียหาย หรือทำให้ไม่ชัดเจนซึ่งเครื่องหมายหรือสัญลักษณ์แสดงความเป็นเจ้าของลิขสิทธิ์หรือเครื่องหมายการค้าของผู้ขายโดยจงใจหรือประมาทเลินเล่ออย่างร้ายแรง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๓ ผู้ซื้อมีสิทธิทำสำเนาโปรแกรมคอมพิวเตอร์ได้ "+result.BackupQty+" ชุด เพื่อป้องกันการสูญหายในการใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ตามข้อ ๘.๔ ข. และอาจทำสำเนามากกว่านั้น หากได้รับความยินยอมเป็นหนังสือจากผู้ขาย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๔ ก. ผู้ซื้อมีสิทธิโอนโปรแกรมคอมพิวเตอร์ตามสัญญานี้ พร้อมด้วยสิทธิและหน้าที่ตามสัญญาฉบับนี้ สำเนาทุกชุดของโปรแกรมคอมพิวเตอร์ และคู่มือการใช้ทั้งหมดให้ผู้รับโอน โดยที่ผู้รับโอนจะต้องตกลงผูกพันตามข้อตกลงในสัญญานี้ทุกประการ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ข. สัญญาฉบับนี้อนุญาตให้ผู้ซื้อบรรจุโปรแกรมคอมพิวเตอร์ลงในเครื่องคอมพิวเตอร์ หมายเลข "+result.ComputerModel+" ของ "+result.ComputerBrand+" ที่อยู่เลขที่ "+result.BuyerAddressNo+" ถนน "+result.BuyerStreet+" ตำบล/แขวง "+result.BuyerSubDistrict+" อำเภอ/เขต "+result.BuyerDistrict+" จังหวัด "+result.BuyerProvince+" ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ขายยินยอมให้มีการเคลื่อนย้ายโปรแกรมคอมพิวเตอร์จากเครื่องคอมพิวเตอร์ตามวรรคหนึ่ง ผู้ขายจะไม่เรียกร้องให้ผู้ซื้อชำระค่าโปรแกรมคอมพิวเตอร์เพิ่มเติมจากที่ได้ตกลงกันตามสัญญานี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๕ ผู้ขายจะไม่โอนลิขสิทธิ์ใดๆ ในโปรแกรมคอมพิวเตอร์ หรือสิทธิการเป็นผู้มีอำนาจอนุญาตให้ผู้อื่นใช้สิทธิในโปรแกรมคอมพิวเตอร์ของตนทั้งหมดหรือแต่บางส่วนตามสัญญานี้ให้แก่บุคคลอื่น", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๙ (ก) การรับประกันความชำรุดบกพร่อง", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๑ ผู้ขายรับรองว่านับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรมคอมพิวเตอร์จะทำงานได้ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วนสมบูรณ์ทุกประการ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๒ ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆ ที่เกิดขึ้นแก่เครื่องคอมพิวเตอร์และอุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใดอันเกิดจาก ความชำรุดบกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด เป็นเวลา "+result.WarrantyPeriodYears+" ปี "+result.WarrantyPeriodMonths+" เดือน นับถัดจากวันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์โดยถูกต้องครบถ้วนตามสัญญา", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์เกิดการชำรุดบกพร่อง หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรมคอมพิวเตอร์ดังกล่าวให้ทำงานได้อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์อันใหม่ที่ได้มาตรฐานและมีคุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า ทั้งนี้ ไม่เกิน "+result.DaysToRepairIn+" วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้งสิ้นแทนผู้ซื้อ", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๙ (ข) การรับประกันความชำรุดบกพร่อง", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๑ ภายในกำหนดระยะเวลาการอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามข้อ ๓.๓ ผู้ขายรับประกันว่านับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรมคอมพิวเตอร์จะทำงานได้ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วนสมบูรณ์ทุกประการ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๒ ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆ ที่เกิดขึ้นแก่เครื่องคอมพิวเตอร์และอุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใด อันเกิดจากความชำรุดบกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด ภายในกำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามข้อ ๓.๓ ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์เกิดการชำรุดบกพร่อง หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรมคอมพิวเตอร์ดังกล่าวให้ทำงานได้อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์อันใหม่ที่ได้มาตรฐานและมีคุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า ทั้งนี้ ไม่เกิน "+result.DaysToRepairIn+" วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้งสิ้นแทนผู้ซื้อ", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๐หลักประกันการปฏิบัติตามสัญญา ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในขณะทำสัญญานี้ ผู้ขายได้นำหลักประกันเป็น "+result.GuaranteeType+" เป็นจำนวนเงิน "+result.GuaranteeAmount+" บาท ("+CommonDAO.NumberToThaiText(result.GuaranteeAmount ?? 0) + ") ซึ่งเท่ากับร้อยละ "+result.GuaranteePercent+" ของราคาค่าโปรแกรมคอมพิวเตอร์ มามอบไว้แก่ผู้ซื้อเพื่อเป็นหลักประกันการปฏิบัติตามสัญญานี้ ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(18) กรณีผู้ขายใช้หนังสือค้ำประกันมาเป็นหลักประกันการปฏิบัติตามสัญญา หนังสือค้ำประกันดังกล่าวจะต้องออกโดยธนาคารที่ประกอบกิจการในประเทศไทย หรือโดยบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบตามแบบที่คณะกรรมการนโยบายการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐกำหนด หรืออาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้ และจะต้องมีอายุการค้ำประกันตลอดไปจนกว่าผู้ขายพ้นข้อผูกพันตามสัญญานี้ ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หลักประกันที่ผู้ขายนำมามอบให้ตามวรรคหนึ่ง จะต้องมีอายุครอบคลุมความรับผิดทั้งปวงของผู้ขายตลอดอายุสัญญา ถ้าหลักประกันที่ผู้ขายนำมามอบให้ดังกล่าวลดลงหรือเสื่อมค่าลง หรือมีอายุไม่ครอบคลุมถึงความรับผิดของผู้ขายตลอดอายุสัญญา ไม่ว่าด้วยเหตุใดๆ ก็ตาม รวมถึงกรณีผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ล่าช้าเป็นเหตุให้ระยะเวลาแล้วเสร็จหรือวันครบกำหนดความรับผิด ในความชำรุดบกพร่อง (ถ้ามี) ตามสัญญาเปลี่ยนแปลงไป ผู้ขายต้องหาหลักประกันใหม่หรือหลักประกันเพิ่มเติมให้มีจำนวนครบถ้วนตามวรรคหนึ่งมามอบให้แก่ผู้ซื้อภายใน "+result.NewGuaranteeDays+"วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หลักประกันที่ผู้ขายนำมามอบไว้ตามข้อนี้ ผู้ซื้อจะคืนให้แก่ผู้ขายโดยไม่มีดอกเบี้ย เมื่อผู้ขายพ้นจากข้อผูกพันและความรับผิดทั้งปวงตามสัญญานี้แล้ว", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๑การอบรม", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายต้องจัดอบรมการใช้งานโปรแกรมคอมพิวเตอร์ตามสัญญานี้ให้แก่เจ้าหน้าที่ของผู้ซื้อให้เข้าใจและสามารถใช้งานโปรแกรมคอมพิวเตอร์ได้เป็นอย่างดี มีประสิทธิภาพ โดยจะต้องส่งหลักสูตรตารางฝึกอบรมและสถานที่ฝึกอบรมให้ผู้ซื้อหรือผู้บริหารจัดการดูแลโปรแกรมคอมพิวเตอร์ที่ผู้ซื้อแต่งตั้งพิจารณาเห็นชอบเป็นหนังสือก่อนดำเนินการฝึกอบรมโดยต้องดำเนินการฝึกอบรมให้แล้วเสร็จภายใน "+result.TrainingPeriodDays+" วัน นับถัดจากวันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โดยไม่คิดค่าใช้จ่ายในการจัดอบรมจากผู้ซื้อ รายละเอียดของการอบรมให้เป็นไปตามเอกสารแนบท้ายสัญญาผนวก ๔ ", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๒คู่มือการใช้โปรแกรมคอมพิวเตอร์และการให้คำแนะนำ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๒.๑ ผู้ขายต้องจัดหาคู่มือการใช้โปรแกรมคอมพิวเตอร์ซึ่งเป็นต้นฉบับ จำนวน "+result.ComputerManualsCount+" ชุด ให้เป็นกรรมสิทธิ์ของผู้ซื้อตามรายละเอียดที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ พร้อมทั้งจะต้องปรับปรุงคู่มือดังกล่าวให้ทันสมัยทุกครั้งที่มีการปรับปรุงโปรแกรมคอมพิวเตอร์ให้ทันสมัยขึ้นตลอดระยะเวลารับประกันตามข้อ ๙.๒ และต้องให้คำแนะนำในการใช้โปรแกรมคอมพิวเตอร์และคู่มือการใช้โปรแกรมคอมพิวเตอร์เมื่อมีการปรับปรุงโปรแกรมคอมพิวเตอร์ดังกล่าว หรือเมื่อผู้ซื้อร้องขอตลอดเวลาระยะเวลารับประกันโดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๒.๒ ผู้ขายต้องให้คำแนะนำแก่ผู้ซื้อในการใช้โปรแกรมคอมพิวเตอร์และคู่มือการใช้โปรแกรมคอมพิวเตอร์ รวมทั้งจะต้องดำเนินการต่างๆ เกี่ยวกับโปรแกรมคอมพิวเตอร์ ในลักษณะของการให้บริการหลังการขาย ทั้งนี้ เพื่อให้โปรแกรมคอมพิวเตอร์สามารถทำงานได้อย่างสมบูรณ์ ตลอดระยะเวลาการรับประกันตามข้อ ๙.๒ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ รายละเอียดเป็นไปตามที่กำหนดในเอกสาร แนบท้ายสัญญาผนวก ๕ แนบท้ายสัญญานี้", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๓การรักษาความลับทางการค้า", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๓.๑ ผู้ซื้อจะไม่เปิดเผยในลักษณะที่จะก่อให้เกิดความเสียหายแก่ผู้ขาย ให้บุคคลอื่นทราบซึ่งข้อมูลหรือเทคนิคเกี่ยวกับโปรแกรมคอมพิวเตอร์ ซึ่งผู้ขายประสงค์ให้เป็นความลับทางการค้าของผู้ขาย และผู้ขายได้แจ้งให้ผู้ซื้อทราบเป็นหนังสือแล้ว", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๓.๒ ผู้ขาย ลูกจ้าง ตัวแทนหรือพนักงานของผู้ขายจะต้องไม่เอาไป เปิดเผย หรือใช้ข้อมูลและ/หรือสารสนเทศของผู้ซื้อ หรือกระทำด้วยประการใดๆ ให้บุคคลอื่นเอาไป เปิดเผย หรือใช้ข้อมูลและ/หรือสารสนเทศของผู้ซื้อ หรือเข้าถึงโดยมิชอบซึ่งข้อมูลและ/หรือสารสนเทศของผู้ซื้อผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์ หรือล่วงรู้มาตรการป้องกันการเข้าถึงข้อมูลและ/หรือสารสนเทศของ ผู้ซื้อผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์ที่จัดทำขึ้นเป็นการเฉพาะ หรือกระทำด้วยประการใดๆ โดยมิชอบด้วยวิธีการทางอิเล็กทรอนิกส์เพื่อดักรับไว้ซึ่งข้อมูลและ/หรือสารสนเทศของผู้ซื้อหรือผู้ที่เกี่ยวข้องกับผู้ซื้อที่อยู่ระหว่างการส่งผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์โดยไม่ชอบด้วยกฎหมาย หรือโดยไม่ได้รับความยินยอมเป็นหนังสือจากผู้ซื้อ", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๔ความคุ้มครองเกี่ยวกับลิขสิทธิ์", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่บุคคลภายนอกกล่าวอ้างหรือใช้สิทธิเรียกร้องใดๆ ว่ามีการละเมิดลิขสิทธิ์หรือสิทธิบัตรหรือสิทธิใดๆ เกี่ยวกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้ โดยผู้ซื้อมิได้แก้ไขดัดแปลงไปจากเดิม หรือแก้ไขดัดแปลงโดยได้รับความยินยอมจากผู้ขายเป็นหนังสือ หรือเป็นกรณีที่กฎหมายอนุญาตให้ทำได้ ผู้ขายจะต้องปกป้องผู้ซื้อและดำเนินการทั้งปวงเพื่อให้การกล่าวอ้างหรือการเรียกร้องดังกล่าวระงับสิ้นไปโดยเร็ว เพื่อให้ผู้ซื้อสามารถใช้โปรแกรมคอมพิวเตอร์นั้นต่อไปได้ ขั้นตอนดังกล่าวอาจรวมถึงการคืนโปรแกรมคอมพิวเตอร์เดิมและเปลี่ยนโปรแกรมคอมพิวเตอร์ที่มีคุณสมบัติไม่ต่ำกว่าโปรแกรมคอมพิวเตอร์เดิมให้ใหม่ ระยะเวลาที่เสียไปดังกล่าวไม่นับรวมเป็นระยะเวลาใช้สิทธิตามสัญญา หากผู้ขายไม่อาจกระทำได้ และผู้ซื้อต้องรับผิดชดใช้ค่าเสียหายต่อบุคคลภายนอก เนื่องจากผลแห่งการละเมิดลิขสิทธิ์ดังกล่าว ผู้ขายต้องเป็นผู้ชำระค่าเสียหาย ค่าปรับ และค่าใช้จ่ายอื่นๆ รวมทั้งค่าฤชาธรรมเนียมและค่าทนายความแทนผู้ซื้อ ทั้งนี้ ผู้ซื้อจะแจ้งให้ผู้ขายทราบเป็นหนังสือในเมื่อได้มีการกล่าวอ้างหรือใช้สิทธิเรียกร้องดังกล่าวโดยไม่ชักช้า", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๕โปรแกรมคอมพิวเตอร์ที่ได้รับการแก้ไขพัฒนาให้ดีขึ้น", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายมีหน้าที่ต้องเสนอโปรแกรมคอมพิวเตอร์ที่ได้รับการพัฒนาให้ทันสมัยเป็นปัจจุบันและดีขึ้นจากรากฐานโปรแกรมคอมพิวเตอร์ตามสัญญานี้ หรือจากรากฐานโปรแกรมคอมพิวเตอร์อื่นที่เกี่ยวพันกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้แก่ผู้ซื้อ และผู้ซื้อมีสิทธิใช้โปรแกรมคอมพิวเตอร์รุ่นที่พัฒนาทันสมัยเป็นปัจจุบันและดีขึ้นแล้วนี้ด้วย โดยผู้ซื้อไม่ต้องจ่ายค่าตอบแทนเพิ่มขึ้นและ/หรือจะต้องจ่ายค่าตอบแทน ให้ผู้ขายตามจำนวนที่จะตกลงกันตามเอกสารแนบท้ายสัญญาผนวก ๖", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การที่ผู้ซื้อเลือกที่จะใช้โปรแกรมคอมพิวเตอร์ที่ได้พัฒนาตามวรรคหนึ่งแล้ว ไม่มีผลกระทบต่อข้อสัญญาอื่นๆ", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๖การบอกเลิกสัญญา", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อครบกำหนดส่งมอบโปรแกรมคอมพิวเตอร์ตามข้อ ๕ แล้ว ถ้าผู้ขายไม่ส่งมอบโปรแกรมคอมพิวเตอร์ให้แก่ผู้ซื้อถูกต้องครบถ้วนภายในกำหนดเวลาดังกล่าว หรือส่งมอบโปรแกรมคอมพิวเตอร์ไม่ตรงตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ และเงื่อนไขต่างๆ ของสัญญานี้ หรือส่งมอบภายในกำหนดแต่ใช้งานไม่ได้ครบถ้วนตามข้อ ๕ หรือผู้ขายผิดสัญญาข้อใดข้อหนึ่ง ผู้ซื้อมีสิทธิบอกเลิกสัญญาทั้งหมดหรือแต่บางส่วนได้การใช้สิทธิบอกเลิกสัญญานั้นไม่กระทบสิทธิของผู้ซื้อที่จะเรียกร้องค่าเสียหายจากผู้ขาย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ซื้อใช้สิทธิบอกเลิกสัญญา ผู้ซื้อมีสิทธิริบหรือบังคับจากหลักประกันตามข้อ ๑๐ เป็นจำนวนเงินทั้งหมดหรือแต่บางส่วนก็ได้ แล้วแต่ผู้ซื้อจะเห็นสมควร ตลอดจนมีสิทธิเรียกค่าเสียหายใดๆ อันเนื่องมาจากผู้ขายไม่ปฏิบัติตามสัญญานี้ และถ้าผู้ซื้อจัดซื้อโปรแกรมคอมพิวเตอร์จากบุคคลอื่น เต็มจำนวนหรือเฉพาะจำนวนที่ขาดส่งแล้วแต่กรณีภายในกำหนด "+result.TeminationNewMonths+" เดือน นับถัดจากวันบอกเลิกสัญญา ผู้ขายจะต้องชดใช้ราคาที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานี้ด้วย", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๗ค่าปรับ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ซื้อยังไม่ใช้สิทธิบอกเลิกสัญญาตามข้อ ๑๖ ผู้ขายจะต้องชำระค่าปรับให้ ผู้ซื้อเป็นรายวันในอัตราร้อยละ "+result.FinePerDaysPercent+" ของราคาโปรแกรมคอมพิวเตอร์ที่ยังไม่ได้รับมอบ นับถัดจากวันครบกำหนดตามสัญญา จนถึงวันที่ผู้ขายได้นำโปรแกรมคอมพิวเตอร์มาส่งมอบให้แก่ผู้ซื้อจนถูกต้องครบถ้วน", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การคิดค่าปรับในกรณีผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ที่ตกลงซื้อขายและอนุญาตให้ใช้สิทธิเพียงบางส่วนหรือขาดส่วนประกอบส่วนใดส่วนหนึ่งไป หรือส่งมอบโปรแกรมคอมพิวเตอร์ทั้งหมด แต่ใช้งานไม่ได้ถูกต้องครบถ้วนตามข้อ ๕ ซึ่งส่งผลให้ระบบคอมพิวเตอร์ทั้งหมดใช้งานไม่ได้ ให้ถือว่ายังไม่ได้ส่งมอบโปรแกรมคอมพิวเตอร์นั้นเลย และให้คิดค่าปรับเป็นรายวันจากราคาโปรแกรมคอมพิวเตอร์ทั้งชุด", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในระหว่างที่ผู้ซื้อไม่ได้ใช้สิทธิบอกเลิกสัญญานั้น ถ้าผู้ซื้อเห็นว่าผู้ขายไม่อาจปฏิบัติตามสัญญาต่อไปได้ ผู้ซื้อจะใช้สิทธิบอกเลิกสัญญาและริบหรือบังคับจากหลักประกันตามข้อ ๑๐ กับเรียกร้องให้ชดใช้ราคาที่เพิ่มขึ้นตามที่กำหนดไว้ในข้อ ๑๖ วรรคสอง ก็ได้ และถ้าผู้ซื้อได้แจ้งข้อเรียกร้องให้ชำระค่าปรับไปยังผู้ขายเมื่อครบกำหนดส่งมอบแล้ว ผู้ซื้อมีสิทธิที่จะปรับผู้ขายจนถึงวันบอกเลิกสัญญาได้อีกด้วย", null, "32"));


                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๘การบังคับค่าปรับ ค่าเสียหาย และค่าใช้จ่าย ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่งด้วยเหตุใดๆ ก็ตาม จนเป็นเหตุให้เกิดค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแก่ผู้ซื้อ ผู้ขายต้องชดใช้ค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายดังกล่าวให้แก่ผู้ซื้อโดยสิ้นเชิงภายในกำหนด "+result.EnforcementOfFineDays+" วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ หากผู้ขายไม่ชดใช้ให้ถูกต้องครบถ้วนภายในระยะเวลาดังกล่าว ให้ผู้ซื้อมีสิทธิที่จะหักเอาจากจำนวนเงินค่าโปรแกรมคอมพิวเตอร์ที่ต้องชำระ หรือบังคับจากหลักประกันการปฏิบัติตามสัญญาได้ทันที", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หากค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายที่บังคับจากเงินค่าโปรแกรมคอมพิวเตอร์ ที่ต้องชำระ หรือหลักประกันการปฏิบัติตามสัญญาแล้วยังไม่เพียงพอ ผู้ขายยินยอมชำระส่วนที่เหลือ ที่ยังขาดอยู่จนครบถ้วนตามจำนวนค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายนั้น ภายในกำหนด "+result.OutstandingPeriodDays+" วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หากมีเงินค่าโปรแกรมคอมพิวเตอร์ตามสัญญาที่หักไว้จ่ายเป็นค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแล้วยังเหลืออยู่อีกเท่าใด ผู้ซื้อจะคืนให้แก่ผู้ขายทั้งหมด", null, "32"));

                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(21) ข้อ ๑๙ การส่งคืนโปรแกรมคอมพิวเตอร์", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อสัญญาสิ้นสุดลง ไม่ว่าจะในกรณีที่มีการเลิกสัญญา หรือกรณีครบกำหนดระยะเวลาการอนุญาตให้ใช้สิทธิ หากผู้ขายมีหนังสือร้องขอภายในกำหนดเวลา "+result.ComputerSendBackDays+" วัน นับถัดจากวันที่สัญญาสิ้นสุดลง ผู้ซื้อจะส่งคืนโปรแกรมคอมพิวเตอร์และสำเนาโปรแกรมคอมพิวเตอร์ตามสัญญานี้คืนให้กับผู้ขาย หากผู้ขายไม่ร้องขอภายในกำหนดเวลาดังกล่าว ให้ถือว่าสละสิทธิการรับคืนโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ", null, "32"));


                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๒๐การงดหรือลดค่าปรับ หรือขยายเวลาส่งมอบ", null, "32", true));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่มีเหตุสุดวิสัย หรือเหตุใดๆ อันเนื่องมาจากความผิดหรือความบกพร่องของฝ่ายผู้ซื้อ หรือจากพฤติการณ์อันหนึ่งอันใดที่ผู้ขายไม่ต้องรับผิดตามกฎหมาย หรือเหตุอื่นตามที่กำหนดในกฎกระทรวง ซึ่งออกตามความในกฎหมายว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ ทำให้ผู้ขายไม่สามารถส่งมอบโปรแกรมคอมพิวเตอร์ตามเงื่อนไขและกำหนดเวลาแห่งสัญญานี้ได้ ผู้ขายมีสิทธิของดหรือลดค่าปรับหรือขยายเวลาตามสัญญาได้โดยจะต้องแจ้งเหตุหรือพฤติการณ์ดังกล่าวพร้อมหลักฐานเป็นหนังสือให้ผู้ซื้อทราบภายใน ๑๕ (สิบห้า) วัน นับถัดจากวันที่เหตุนั้นสิ้นสุดลง หรือตามที่กำหนดในกฎกระทรวงดังกล่าว แล้วแต่กรณี", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายไม่ปฏิบัติให้เป็นไปตามความในวรรคหนึ่ง ให้ถือว่าผู้ขายได้สละสิทธิเรียกร้องในการที่จะของดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญา โดยไม่มีเงื่อนไขใดๆ ทั้งสิ้น เว้นแต่กรณี     เหตุเกิดจากความผิดหรือความบกพร่องของฝ่ายผู้ซื้อซึ่งมีหลักฐานชัดแจ้งหรือผู้ซื้อทราบดีอยู่แล้วตั้งแต่ต้น", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การงดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญาตามวรรคหนึ่ง อยู่ในดุลพินิจของผู้ซื้อที่จะพิจารณาตามที่เห็นสมควร", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("สัญญานี้ทำขึ้นสองฉบับ มีข้อความถูกต้องตรงกัน คู่สัญญาได้อ่านและเข้าใจข้อความโดยละเอียดตลอดแล้ว จึงได้ลงลายมือชื่อพร้อมทั้งประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยาน และคู่สัญญาต่างยึดถือไว้ฝ่ายละหนึ่งฉบับ", null, "32"));



                body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ "+result.OSMEP_Signer+" ผู้ซื้อ"));
                body.AppendChild(WordServiceSetting.CenteredParagraph("(................................................................................)"));
                body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ "+result.Contract_Signer+" ผู้ขาย"));
                body.AppendChild(WordServiceSetting.CenteredParagraph("(................................................................................)"));
                body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ "+result.OSMEP_Witness+" พยาน"));
                body.AppendChild(WordServiceSetting.CenteredParagraph("(...............................................................................)"));
                body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ "+result.OSMEP_Witness+" พยาน"));
                body.AppendChild(WordServiceSetting.CenteredParagraph("(...............................................................................)"));

                // next page
               // body.AppendChild(new Paragraph(new Run(new Break() { Type = BreakValues.Page })));
                body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("วิธีปฏิบัติเกี่ยวกับสัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์", "000000", "36"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(1) ให้ระบุเลขที่สัญญาในปีงบประมาณหนึ่งๆ ตามลำดับ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(2) ให้ระบุชื่อของหน่วยงานของรัฐที่เป็นนิติบุคคล เช่น กรม ก. หรือรัฐวิสาหกิจ ข. เป็นต้น", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(3) ให้ระบุชื่อและตำแหน่งของหัวหน้าหน่วยงานของรัฐที่เป็นนิติบุคคลนั้น หรือผู้ที่ได้รับมอบอำนาจ เช่น นาย ก. อธิบดีกรม………...… หรือ นาย ข. ผู้ได้รับมอบอำนาจจากอธิบดีกรม………......………..", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(4) ให้ระบุชื่อผู้ให้เช่า", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ก. กรณีนิติบุคคล เช่น ห้างหุ้นส่วนสามัญจดทะเบียน ห้างหุ้นส่วนจำกัด บริษัทจำกัด", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ข. กรณีบุคคลธรรมดา ให้ระบุชื่อและที่อยู่", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(5) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(6) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๗) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๘) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ ๓ วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่ไว้ตรวจรับของนั้น", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย และในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๙) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ ๓ วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่ไว้ตรวจรับของนั้น", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย และในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๑๐) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("๑๑) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๑๒) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(13) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(14) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะของสิ่งของที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(15) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะของสิ่งของที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(16) “หลักประกัน” หมายถึง หลักประกันที่ผู้รับจ้างนำมามอบไว้แก่หน่วยงานของรัฐเมื่อลงนามในสัญญาเพื่อประกันความเสียหายที่อาจเกิดขึ้นจากการปฏิบัติตามสัญญา ดังนี้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑)เงินสด ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๒)เช็คหรือดราฟท์ที่ธนาคารเซ็นสั่งจ่าย ซึ่งเป็นเช็คหรือดราฟท์ลงวันที่ที่ใช้เช็คหรือดราฟท์นั้นชำระต่อเจ้าหน้าที่ หรือก่อนวันนั้นไม่เกิน ๓ วันทำการ ", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๓)หนังสือคํ้าประกันของธนาคารภายในประเทศตามตัวอย่างที่คณะกรรมการนโยบายกําหนด โดยอาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๔)หนังสือค้ำประกันของบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบ โดยอนุโลมให้ใช้ตามตัวอย่างหนังสือค้ำประกันของธนาคารที่คณะกรรมการนโยบายกําหนด", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๕)พันธบัตรรัฐบาลไทย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(17) ให้กำหนดจำนวนเงินหลักประกันการปฏิบัติตามสัญญาตามระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๘ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(18) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(19) กำหนดเวลาที่ผู้ซื้อจะซื้อสิ่งของจากแหล่งอื่นเมื่อบอกเลิกสัญญาและมีสิทธิเรียกเงินในส่วนที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานั้น ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(20) อัตราค่าปรับตามสัญญาข้อ ๑๗ ให้กำหนดเป็นรายวันในอัตราตายตัวระหว่างร้อยละ ๐.๐๑ – ๐.๒๐ ของราคาพัสดุที่ยังไม่ได้ส่งมอบ ตามระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๒ ส่วนกรณีจะปรับร้อยละเท่าใด ให้อยู่ในดุลพินิจของหน่วยงานของรัฐผู้ซื้อที่จะพิจารณา โดยคำนึงถึงราคาและลักษณะของพัสดุที่ซื้อ ซึ่งอาจมีผลกระทบต่อการที่ผู้ขายจะหลีกเลี่ยงไม่ปฏิบัติตามสัญญา แต่ทั้งนี้ การที่จะกำหนดค่าปรับเป็นร้อยละเท่าใดจะต้องกำหนดไว้ในเอกสารเชิญชวนด้วย", null, "32"));
                body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(21) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));




                body.AppendChild(WordServiceSetting.EmptyParagraph());




                WordServiceSetting.AddHeaderWithPageNumber(mainPart, body);

            }
            stream.Position = 0;
            return stream.ToArray();
        }
   
    }

    public async Task<string> OnGetWordContact_BuyAgreeProgram_ToPDF(string id,string typeContact)
    {
        try
        {
            var result = await _e.GetSLAAsync(id);
            if (result == null)
            {
                throw new Exception("SLA 308-60 data not found.");
            }
            else
            {
                var info = await _e.GetSLAInfoAsync(id);


                var fontPath = Path.Combine(Directory.GetCurrentDirectory(), "wwwroot", "font", "THSarabunNew.ttf").Replace("\\", "/");
                var cssPath = Path.Combine(Directory.GetCurrentDirectory(), "wwwroot", "css", "contract.css").Replace("\\", "/");
                var logoPath = Path.Combine(Directory.GetCurrentDirectory(), "wwwroot", "images", "logo_SME.jpg");
                string logoBase64 = "";
                if (System.IO.File.Exists(logoPath))
                {
                    var bytes = System.IO.File.ReadAllBytes(logoPath);
                    logoBase64 = Convert.ToBase64String(bytes);
                }

                var listDocAtt = await _eContractDAO.GetRelatedDocumentsAsync(id, "SPA30560");
                var htmlDocAtt = listDocAtt != null
                    ? string.Join("", listDocAtt.Select(docItem =>
                        $"<p class='tab3 t-16'>{docItem.DocumentTitle} จำนวน {docItem.PageAmount} หน้า</div>"))
                    : "";

                var slaInstall = await _e.GetSLAInstallmentAsync(id);

                string datestring = CommonDAO.ToThaiDateStringCovert(result.ContractSignDate ?? DateTime.Now);
                string strTotalAmount = CommonDAO.NumberToThaiText(result.TotalAmount ?? 0);
                string strVatAmount = CommonDAO.NumberToThaiText(result.VatAmount ?? 0);


                #region  signlist
                var signlist = await _eContractReportDAO.GetSignNameAsync(id, typeContact);
                var signatoryHtml = new StringBuilder();
                var companySealHtml = new StringBuilder();

                foreach (var signer in signlist)
                {
                    string signatureHtml;
                    string companySeal = ""; // Initialize to avoid unassigned variable warning

                    // Fix CS8602: Use null-conditional operator for Position and Company_Seal
                    if (signer?.Signatory_Type == "CP_S" && !string.IsNullOrEmpty(signer?.Company_Seal))
                    {
                        try
                        {
                            var contentStart = signer.Company_Seal.IndexOf("<content>") + "<content>".Length;
                            var contentEnd = signer.Company_Seal.IndexOf("</content>");
                            var base64 = signer.Company_Seal.Substring(contentStart, contentEnd - contentStart);

                            companySeal = $@"
<div class='t-16 text-center tab1'>
                <img src='data:image/png;base64,{base64}' alt='signature' style='max-height: 80px;' />
            </div>";

                            companySealHtml.AppendLine($@"
    <div class='text-center'>
        {companySeal}      
    </div>
<div class='t-16 text-center tab1'>(ตราประทับ บริษัท)</div>

");
                        }
                        catch
                        {
                            companySeal = "<div class='t-16 text-center tab1'>(ตราประทับ บริษัท)</div>";
                        }
                    }

                    if (!string.IsNullOrEmpty(signer?.DS_FILE) && signer.DS_FILE.Contains("<content>"))
                    {
                        try
                        {
                            var contentStart = signer.DS_FILE.IndexOf("<content>") + "<content>".Length;
                            var contentEnd = signer.DS_FILE.IndexOf("</content>");
                            var base64 = signer.DS_FILE.Substring(contentStart, contentEnd - contentStart);

                            signatureHtml = $@"<div class='t-16 text-center tab1'>
                <img src='data:image/png;base64,{base64}' alt='signature' style='max-height: 80px;' />
            </div>";
                        }
                        catch
                        {
                            signatureHtml = "<div class='t-16 text-center tab1'>(ลงชื่อ....................)</div>";
                        }
                    }
                    else
                    {
                        signatureHtml = "<div class='t-16 text-center tab1'>(ลงชื่อ....................)</div>";
                    }

                    signatoryHtml.AppendLine($@"
    <div class='sign-single-right'>
        {signatureHtml}
        <div class='t-16 text-center tab1'>({signer?.Signatory_Name})</div>
        <div class='t-16 text-center tab1'>{signer?.BU_UNIT}</div>
    </div>");

                    signatoryHtml.Append(companySealHtml);
                }

                #endregion signlist


                var htmlBody = $@"
<div class='contract'>
    <h1 class='text-center t-22' style='font-weight:bold;'>แบบสัญญา</h>
    <h2 class='text-center t-22' style='font-weight:bold;'>สัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์</h2>
</br>
    <div class=''></div>
    <div class='text-right t-16'>สัญญาเลขที่…{result.Contract_Number}.</div>
    <p class='tab2 t-16'>
        สัญญาฉบับนี้ทำขึ้น ณ สำนักงานส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อม (สสว.)
        ตำบล/แขวง </br>ทุ่งสองห้อง อำเภอ/เขต หลักสี่
        จังหวัด กรุงเทพ เมื่อ {datestring}
        ระหว่าง {result.Contract_Organization}
        โดย {result.SignatoryName}
        ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ซื้อ” 
ฝ่ายหนึ่ง กับ {result.ContractorName}
    </p>
    {(result.ContractorType == "นิติบุคคล" ?
$@"<p class='tab2 t-16'>
            ซึ่งจดทะเบียนเป็นนิติบุคคล ณ {result.ContractorName} มี สำนักงานใหญ่อยู่เลขที่ {result.ContractorAddressNo} ถนน {result.ContractorStreet} ตำบล/แขวง {result.ContractorSubDistrict}
            อำเภอ/เขต {result.ContractorDistrict} จังหวัด {result.ContractorProvince}
            โดย {result.ContractorSignatoryName}
            มีอำนาจลงนามผูกพันนิติบุคคลปรากฏตามหนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท ……………
            ลงวันที่ {datestring} (5)(และหนังสือมอบอำนาจลง 
</br>{datestring}) แนบท้ายสัญญานี้
        </p>"
:
$@"<p class='tab2 t-16'>
            (6)(ในกรณีที่ผู้รับจ้างเป็นบุคคลธรรมดาให้ใช้ข้อความว่า กับ {result.ContractorName}
            อยู่บ้านเลขที่ {result.ContractorAddressNo} ถนน {result.ContractorStreet} ตำบล/แขวง {result.ContractorSubDistrict}
            อำเภอ/เขต {result.ContractorDistrict} จังหวัด {result.ContractorProvince}
            ผู้ถือบัตรประจำตัวประชาชนเลขที่ {result.CitizenId} ดังปรากฏตามสำเนาบัตรประจำตัวประชาชนแนบท้ายสัญญานี้) ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ให้เช่า” อีกฝ่ายหนึ่ง
        </p>"
)}
    <p class='tab2 t-16'>คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้</p>
    <p class='tab2 t-16'><b>ข้อ ๑ คำนิยาม</b></p>
    <p class='tab3 t-16'>“โปรแกรมคอมพิวเตอร์” หมายความว่า คำสั่ง ชุดคำสั่งหรือสิ่งอื่นใดที่นำไปใช้กับเครื่องคอมพิวเตอร์ 
เพื่อให้เครื่องคอมพิวเตอร์ทำงานหรือเพื่อให้ได้รับผลอย่างหนึ่งอย่างใด ทั้งนี้ ไม่ว่าจะเป็นภาษา
</br>โปรแกรมคอมพิวเตอร์ในลักษณะใดที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้</p>
    <p class='tab3 t-16'>“สื่อ” หมายความว่า วัตถุซึ่งมีโปรแกรมคอมพิวเตอร์บันทึกอยู่</p>

   <p class='tab2 t-16'><b>ข้อ ๒ ข้อตกลงซื้อขายและอนุญาตให้ใช้สิทธิ</b></p>
    <p class='tab3 t-16'>ผู้ซื้อตกลงซื้อ และผู้ขายตกลงขาย และอนุญาตให้ใช้สิทธิโปรแกรมคอมพิวเตอร์ พร้อมด้วย
</br>สื่อและคู่มือการใช้โปรแกรมคอมพิวเตอร์ เป็นราคาทั้งสิ้น {result.TotalAmount} บาท 
</br>({strTotalAmount}) ซึ่งเป็นราคาที่ได้รวมภาษีมูลค่าเพิ่มจำนวน {result.VatAmount} บาท ({strVatAmount}) ตลอดจนภาษีอากรอื่น ๆ
</br>และค่าใช้จ่ายทั้งปวงด้วยแล้ว
รายละเอียดโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิเป็นไปตามเอกสารแนบท้ายสัญญาผนวก ๑</p>

    <p class='tab2 t-16'><b>ข้อ ๓ การรับรองและการอนุญาตให้ใช้สิทธิ</b></p>
    <p class='tab3 t-16'>๓.๑ ผู้ขายรับรองและยืนยันว่าผู้ขายเป็นเจ้าของลิขสิทธิ์ รวมถึงสิทธิในทรัพย์สิน
ทางปัญญา
</br>อื่นใด และมีสิทธิแต่ผู้เดียวอย่างสมบูรณ์โดยปราศจากภาระผูกพันใดๆ อันจะทำให้เสื่อมสิทธิในโปรแกรม
</br>คอมพิวเตอร์หรือคู่มือการใช้หรือสิ่งอื่นใดที่เกี่ยวข้องกับโปรแกรมคอมพิวเตอร์ และ/หรือผู้ขายรับรอง
</br>และยืนยันว่ามีอำนาจในการอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ คู่มือการใช้หรือสิ่งอื่นใดที่เกี่ยวข้องกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้โดยชอบด้วยกฎหมาย
</p>
  
<p class='tab3 t-16'>๓.๒ ผู้ขายตกลงอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ในหลายลักษณะหรือลักษณะใดลักษณะหนึ่งเพียงลักษณะเดียวดังนี้</p>
    <p class='tab3 t-16'>ใช้โปรแกรมคอมพิวเตอร์หนึ่งชุดกับเครื่องคอมพิวเตอร์เครื่องใดเครื่องหนึ่ง(Single License)
</br>โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ในขณะเดียวกันไม่เกิน {info.SWRight_1_Detail} คน</p>
  
<p class='tab3 t-16'>ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ที่บรรจุโปรแกรมคอมพิวเตอร์
</br>จำนวน {info.SWRight_2_Detail_1} เครื่อง (Volume License) โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ที่บรรจุในเครื่องคอมพิวเตอร์แต่ละ
</br>เครื่องในขณะเดียวกันไม่เกิน {info.SWRight_2_Detail_2} คน</p>

    <p class='tab3 t-16'>ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์หลักในระบบเครือข่ายเพื่อทำให้เครื่อง
</br>คอมพิวเตอร์ จำนวน {info.SWRight_3_Detail} เครื่อง สามารถใช้โปรแกรมคอมพิวเตอร์ได้ ในขณะเดียวกัน (Network License) </p>

    <p class='tab3 t-16'>ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ของผู้ซื้อได้ โดยไม่จำกัดจำนวน ในขณะเดียวกัน (Corporate License)</p>

  
<p class='tab3 t-16'>(๗) ๓.๓ กำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ เริ่มต้นตั้งแต่วันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วน และสิ้นสุดวันที่ {result.SWExpiry_Date} รวมเป็นเวลา {result.TotalYears} ปี {result.TotalMonths} เดือน {result.TotalDays} วัน</p>
   
<p class='tab3 t-16'>๓.๔ ในกรณีที่ผู้ขายเป็นผู้มีอำนาจอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์
ตามสัญญานี้ ผู้ขายได้นำเอกสารหลักฐานเกี่ยวกับการเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ดังกล่าว </br>ซึ่งออกโดยเจ้าของลิขสิทธิ์ มามอบให้แก่ผู้ซื้อในขณะลงนามในสัญญานี้
</p>
    <p class='tab3 t-16'>เอกสารหลักฐานที่แสดงว่าผู้ขายเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ 
</br>ซึ่งผู้ขายจะต้องนำมามอบให้แก่ผู้ซื้อตามวรรคหนึ่ง จะต้องมีข้อความที่แสดงให้เห็นว่า ในกรณีที่ผู้ขายเลิกกิจ
</br>การหรือถูกเพิกถอนการอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้จากเจ้าของลิขสิทธิ์ เจ้าของ
</br>ลิขสิทธิ์จะยอมผูกพันตามสัญญานี้แทนผู้ขายหรือจัดให้ผู้มีอำนาจอนุญาต ให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์
</br>รายอื่นผูกพันตามสัญญานี้แทนผู้ขาย และอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ โดยผู้ซื้อไม่ต้อง
</br>เสียค่าใช้จ่ายใดๆ ทั้งสิ้น
</p>
   <p class='tab2 t-16'><b>ข้อ ๔ เอกสารอันเป็นส่วนหนึ่งของสัญญา</b></p>
    <p class='tab3 t-16'>เอกสารแนบท้ายสัญญาดังต่อไปนี้ ให้ถือเป็นส่วนหนึ่งของสัญญานี้</p>
{htmlDocAtt}
    <p class='tab3 t-16'>ความใดในเอกสารแนบท้ายสัญญาที่ขัดหรือแย้งกับข้อความในสัญญานี้ ให้ใช้ข้อความใน
</br>สัญญานี้บังคับ และในกรณีที่เอกสารแนบท้ายสัญญาขัดแย้งกันเอง ผู้ขายจะต้องปฏิบัติตามคำวินิจฉัยของผู้ซื้อ 
</br>คำวินิจฉัยของผู้ซื้อให้ถือเป็นที่สุด และผู้ขายไม่มีสิทธิเรียกร้องราคา ค่าเสียหาย หรือค่าใช้จ่ายใดๆ เพิ่มเติมจากผู้ซื้อทั้งสิ้น
</p>  

<p class='tab2 t-16'><b>ข้อ ๕ การส่งมอบ</b></p>
    <p class='tab3 t-16'>ผู้ขายจะต้องส่งมอบและติดตั้งโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิ
</br>ตามสัญญานี้ให้มีคุณสมบัติถูกต้องและครบถ้วนตามที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ 
</br>และผนวก ๒ 
ดยให้พร้อมใช้งานได้ตามรายละเอียดการทดสอบที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๓ ให้แก่ผู้ซื้อ ณ  {result.DeliveryLocation} ภายใน… {result.DeliveryDateIn} วัน นับถัดจากวันลงนามในสัญญา</p>
   
<p class='tab3 t-16'>ในกรณีผู้ขายประสงค์จะนำโปรแกรมคอมพิวเตอร์รายการใดที่ต่างไปจากรายละเอียด 
</br>ที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ มาส่งมอบและติดตั้งให้ผู้ซื้อ ผู้ขายต้องได้รับความยินยอมเป็นหนังสือจากผู้ซื้อก่อน และโปรแกรมคอมพิวเตอร์ที่จะนำมาส่งมอบดังกล่าวนั้นจะต้องมีคุณสมบัติ
</br>ไม่ต่ำกว่าที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒</p>
    <p class='tab3 t-16'>การส่งมอบโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ไม่ว่าจะเป็นการส่งมอบเพียงครั้งเดียว 
หรือส่งมอบหลายครั้ง ผู้ขายจะต้องแจ้งกำหนดเวลาส่งมอบแต่ละครั้งโดยทำเป็นหนังสือยื่นต่อผู้ซื้อ 
ณ {result.NotiLocation} ในวันและเวลาทำการของผู้ซื้อ ก่อนวันส่งมอบไม่น้อยกว่า {result.DeliveryDateIn} วันทำการของผู้ซื้อ</p>
   
<p class='tab2 t-16'><b>ข้อ ๖ การตรวจรับ</b></p>
    <p class='tab3 t-16'>เมื่อผู้ซื้อได้ตรวจรับโปรแกรมคอมพิวเตอร์ที่ส่งมอบและเห็นว่าถูกต้องครบถ้วน ตาม
</br>รายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก ๑ และ
</br>ผนวก ๒ แนบท้ายสัญญานี้และเงื่อนไขต่างๆ ของสัญญานี้แล้ว ผู้ซื้อจะออกหนังสือแสดงการรับมอบ
</br>โปรแกรมคอมพิวเตอร์เพื่อผู้ขายใช้เป็นหลักฐานประกอบการขอรับชำระราคาค่าโปรแกรมคอมพิวเตอร์</p>
    <p class='tab3 t-16'>ถ้าผลการตรวจรับปรากฏว่า โปรแกรมคอมพิวเตอร์ที่ผู้ขายส่งมอบไม่ถูกต้องครบถ้วน
หรือไม่
ตรงตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์แนบท้ายสัญญานี้ และเงื่อนไขต่างๆ
ของสัญญานี้ หรือใช้งานได้ไม่ถูกต้องครบถ้วนตามข้อ ๕ ผู้ซื้อทรงไว้ซึ่งสิทธิที่จะไม่รับโปรแกรมคอมพิวเตอร์นั้น 
</br>ในกรณีเช่นว่านี้ ผู้ขายต้องนำโปรแกรมคอมพิวเตอร์นั้นกลับคืนโดยเร็วที่สุดเท่าที่จะทำได้และนำโปรแกรม
</br>คอมพิวเตอร์ใหม่มาส่งมอบให้แก่ผู้ซื้อ หรือต้องทำการแก้ไขให้ถูกต้องตามสัญญาด้วยค่าใช้จ่ายของผู้ขายเอง
</br>และระยะเวลาที่เสียไปเพราะเหตุดังกล่าว ผู้ขายจะนำมาอ้างเป็นเหตุขอขยายเวลาตามสัญญาหรือของดหรือลดค่าปรับไม่ได้
</p>



  
<p class='tab3 t-16'>(๑๐) ในกรณีที่ผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ไม่ครบถ้วนหรือส่งมอบครบถ้วน แต่ใช้งาน
ได้ไม่ถูกต้องตามที่กำหนดไว้ในข้อ ๕ แต่ไม่ถึงกับทำให้ระบบคอมพิวเตอร์ทั้งหมดใช้การไม่ได้ ผู้ซื้อจะตรวจรับ
</br>โปรแกรมคอมพิวเตอร์เฉพาะส่วนที่ใช้งานได้ถูกต้องครบถ้วน โดยออกหนังสือแสดงการรับมอบโปรแกรม
</br>คอมพิวเตอร์เฉพาะส่วนนั้นก็ได้
</p>
    <p class='tab3 t-16'>การตรวจรับจะสมบูรณ์ตามสัญญานี้ก็ต่อเมื่อผู้ซื้อได้ทดสอบโปรแกรมคอมพิวเตอร์ ว่า
</br>สามารถปฏิบัติงานได้เต็มความประสงค์ของผู้ซื้ออย่างถูกต้องครบถ้วน</p>
   <p class='tab2 t-16'><b>ข้อ ๗ การชำระเงิน</b></p>
   
     <p class='tab3 t-16'>(๑๑) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย 
</br>เมื่อผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วนตามข้อ ๖ และผู้ขายได้อบรมเจ้าหน้าที่ของผู้ซื้อตาม
</br>ข้อ ๑๑ เสร็จสิ้นแล้ว</p>

<p class='tab3 t-16'>(๑๒) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย 
</br>เป็นงวดๆ รวม {(slaInstall != null ? slaInstall.ToList().Count : 0)} งวด ดังนี้</p>
    {(slaInstall != null ? string.Join("", slaInstall.Select(item => $@"
        <p class='tab3 t-16'>งวดที่หนึ่งเป็นเงิน {item.TotalAmount?.ToString("N2") ?? "0.00"}
 บาท ({CommonDAO.NumberToThaiText(item.TotalAmount ?? 0)}) 
</br>จะจ่ายให้เมื่อผู้ซื้อได้ใช้โปรแกรมคอมพิวเตอร์เป็นเวลา {item.UseMonth} เดือน</p>
        {(item == slaInstall.Last() ? $@"<p class='tab3 t-16'>งวดสุดท้ายเป็นเงิน {item.TotalAmount?.ToString("N2") ?? "0.00"}
 บาท ({CommonDAO.NumberToThaiText(item.TotalAmount ?? 0)}) 
</br>จะจ่ายให้เมื่อครบกำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ดังกล่าว</p>" : "")}
    ")) : "")}
    <p class='tab3 t-16'>การจ่ายเงินตามเงื่อนไขแห่งสัญญานี้ ผู้ซื้อจะโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขาย 
</br>ชื่อธนาคาร {result.SaleBankName} สาขา {result.SaleBankBranch}  ชื่อบัญชี {result.SaleBankAccountName} เลขที่บัญชี {result.SaleBankAccountNumber} ทั้งนี้ผู้ขายตกลงเป็นผู้รับภาระเงินค่าธรรมเนียม หรือค่าบริการอื่นใดเกี่ยวกับการโอน รวมทั้งค่าใช้จ่ายอื่นใด (ถ้ามี) ที่ธนาคารเรียกเก็บและยินยอมให้มีการหักเงินดังกล่าวจากจำนวนเงินโอนในงวดนั้นๆ (ความในวรรคนี้ใช้สำหรับกรณีที่หน่วยงานของรัฐจะจ่ายเงินตรงแก่ผู้ขาย (ระบบ Direct Payment) โดยการโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขายตามแนวทางที่กระทรวงการคลังหรือหน่วยงานของรัฐเจ้าของงบประมาณเป็นผู้กำหนดแล้วแต่กรณี)</p>
<p class='tab2 t-16'><b>ข้อ ๘ สิทธิของผู้ซื้อ</b></p>
<p class='tab3 t-16'>๘.๑ ผู้ซื้อมีสิทธิที่จะใช้โปรแกรมคอมพิวเตอร์และคู่มือสำหรับผู้ใช้โปรแกรมคอมพิวเตอร์ตามสัญญานี้</p>
<p class='tab3 t-16'>๘.๒ ผู้ซื้อขอรับรองว่าจะไม่ลบ ทำลาย ทำให้เสียหาย หรือทำให้ไม่ชัดเจนซึ่งเครื่องหมายหรือสัญลักษณ์แสดงความเป็นเจ้าของลิขสิทธิ์หรือเครื่องหมายการค้าของผู้ขายโดยจงใจหรือประมาทเลินเล่ออย่างร้ายแรง</p>
<p class='tab3 t-16'>๘.๓ ผู้ซื้อมีสิทธิทำสำเนาโปรแกรมคอมพิวเตอร์ได้ {result.BackupQty} ชุด เพื่อป้องกันการสูญหายในการใช้
</br>โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ตามข้อ ๘.๔ ข. และอาจทำสำเนามากกว่านั้น หากได้รับความ
</br>ยินยอมเป็นหนังสือจากผู้ขาย</p>
<p class='tab3 t-16'>๘.๔ ก. ผู้ซื้อมีสิทธิโอนโปรแกรมคอมพิวเตอร์ตามสัญญานี้ พร้อมด้วยสิทธิและหน้าที่ตาม
</br>สัญญาฉบับนี้ สำเนาทุกชุดของโปรแกรมคอมพิวเตอร์ และคู่มือการใช้ทั้งหมดให้ผู้รับโอน โดยที่ผู้รับโอนจะ
</br>ต้องตกลงผูกพันตามข้อตกลงในสัญญานี้ทุกประการ</p>
<p class='tab3 t-16'>ข. สัญญาฉบับนี้อนุญาตให้ผู้ซื้อบรรจุโปรแกรมคอมพิวเตอร์ลงในเครื่องคอมพิวเตอร์ 
</br>หมายเลข {result.ComputerModel} ของ {result.ComputerBrand} ที่อยู่เลขที่ {result.BuyerAddressNo} ถนน {result.BuyerStreet} 
</br>ตำบล/แขวง {result.BuyerSubDistrict} อำเภอ/เขต {result.BuyerDistrict} จังหวัด {result.BuyerProvince}</p>
<p class='tab3 t-16'>ในกรณีที่ผู้ขายยินยอมให้มีการเคลื่อนย้ายโปรแกรมคอมพิวเตอร์จากเครื่องคอมพิวเตอร์ตาม
</br>วรรคหนึ่ง ผู้ขายจะไม่เรียกร้องให้ผู้ซื้อชำระค่าโปรแกรมคอมพิวเตอร์เพิ่มเติมจากที่ได้ตกลงกันตามสัญญานี้</p>
<p class='tab3 t-16'>๘.๕ ผู้ขายจะไม่โอนลิขสิทธิ์ใดๆ ในโปรแกรมคอมพิวเตอร์ หรือสิทธิการเป็นผู้มีอำนาจอนุญาตให้ผู้อื่นใช้สิทธิในโปรแกรมคอมพิวเตอร์ของตนทั้งหมดหรือแต่บางส่วนตามสัญญานี้ให้แก่บุคคลอื่น</p>

<p class='tab2 t-16'><b>ข้อ ๙ (ก) การรับประกันความชำรุดบกพร่อง</b></p>
<p class='tab3 t-16'>๙.๑ ผู้ขายรับรองว่านับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรม
</br>คอมพิวเตอร์จะทำงานได้ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วนสมบูรณ์ทุกประการ</p>
<p class='tab3 t-16'>๙.๒ ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆ ที่เกิดขึ้นแก่
</br>เครื่องคอมพิวเตอร์และอุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใดอันเกิดจาก ความชำรุด
</br>บกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด เป็นเวลา {result.WarrantyPeriodYears} ปี {result.WarrantyPeriodMonths} เดือน นับถัดจากวันที่ผู้ซื้อได้รับ
</br>มอบโปรแกรมคอมพิวเตอร์โดยถูกต้องครบถ้วนตามสัญญา</p>

<p class='tab3 t-16'>ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์เกิดการชำรุดบกพร่อง 
หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรม
</br>คอมพิวเตอร์ดังกล่าวให้ทำงานได้อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์อันใหม่ที่ได้มาตรฐานและมี
</br>คุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า ทั้งนี้ 
</br>ไม่เกิน {result.DaysToRepairIn} วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น</p>
<p class='tab3 t-16'>ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้งสิ้น
</br>แทนผู้ซื้อ</p>

<p class='tab2 t-16'>ข้อ ๙ (ข) การรับประกันความชำรุดบกพร่อง</p>
<p class='tab3 t-16'>๙.๑ ภายในกำหนดระยะเวลาการอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามข้อ ๓.๓ 
</br>ผู้ขายรับประกันว่านับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรมคอมพิวเตอร์จะทำงาน
</br>ได้ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วนสมบูรณ์ทุกประการ</p>
<p class='tab3 t-16'>๙.๒ ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆ ที่เกิดขึ้นแก่
</br>เครื่องคอมพิวเตอร์และอุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใด อันเกิดจากความ
</br>ชำรุดบกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด ภายในกำหนดระยะเวลาอนุญาตให้ใช้สิทธิ
</br>ในโปรแกรมคอมพิวเตอร์ตามข้อ ๓.๓</p>
<p class='tab3 t-16'>ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์เกิดการชำรุดบกพร่อง 
</br>หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรม
</br>คอมพิวเตอร์ดังกล่าวให้ทำงานได้อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์อันใหม่ที่ได้มาตรฐานและ
</br>มีคุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า
</br>ทั้งนี้ ไม่เกิน {result.DaysToRepairIn} วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น</p>
<p class='tab3 t-16'>ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลา
</br>ดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้ง
</br>สิ้นแทนผู้ซื้อ</p>


  <p class='tab2 t-16'><b>ข้อ ๑๐ หลักประกันการปฏิบัติตามสัญญา</b></p>
<p class='tab3 t-16'>ในขณะทำสัญญานี้ ผู้ขายได้นำหลักประกันเป็น {result.GuaranteeType} เป็นจำนวนเงิน {result.GuaranteeAmount} บาท 
</br>({CommonDAO.NumberToThaiText(result.GuaranteeAmount ?? 0)}) ซึ่งเท่ากับร้อยละ {result.GuaranteePercent} ของราคาค่าโปรแกรมคอมพิวเตอร์ มามอบไว้แก่ผู้ซื้อเพื่อเป็นหลักประกันการปฏิบัติตามสัญญานี้</p>
<p class='tab3 t-16'>(๑๘) กรณีผู้ขายใช้หนังสือค้ำประกันมาเป็นหลักประกันการปฏิบัติตามสัญญา หนังสือค้ำ
</br>ประกันดังกล่าวจะต้องออกโดยธนาคารที่ประกอบกิจการในประเทศไทย หรือโดยบริษัทเงินทุนหรือบริษัทเงิน
</br>ทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตาม
</br>ประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบ
</br>ตามแบบที่คณะกรรมการนโยบายการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐกำหนด หรืออาจเป็นหนังสือค้ำ
</br>ประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้ และจะต้องมีอายุการค้ำประกันตลอดไปจนกว่า
</br>ผู้ขายพ้นข้อผูกพันตามสัญญานี้</p>

<p class='tab3 t-16'>หลักประกันที่ผู้ขายนำมามอบให้ตามวรรคหนึ่ง จะต้องมีอายุครอบคลุมความรับผิดทั้งปวง
</br>ของผู้ขายตลอดอายุสัญญา ถ้าหลักประกันที่ผู้ขายนำมามอบให้ดังกล่าวลดลงหรือเสื่อมค่าลง หรือมีอายุไม่
</br>ครอบคลุมถึงความรับผิดของผู้ขายตลอดอายุสัญญา ไม่ว่าด้วยเหตุใดๆ ก็ตาม รวมถึงกรณีผู้ขายส่งมอบ
</br>โปรแกรมคอมพิวเตอร์ล่าช้าเป็นเหตุให้ระยะเวลาแล้วเสร็จหรือวันครบกำหนดความรับผิด ในความชำรุด 
</br>บกพร่อง(ถ้ามี) ตามสัญญาเปลี่ยนแปลงไป ผู้ขายต้องหาหลักประกันใหม่หรือหลักประกันเพิ่มเติมให้มีจำนวน
</br>ครบถ้วนตามวรรคหนึ่งมามอบให้แก่ผู้ซื้อภายใน {result.NewGuaranteeDays} วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ</p>
<p class='tab3 t-16'>หลักประกันที่ผู้ขายนำมามอบไว้ตามข้อนี้ ผู้ซื้อจะคืนให้แก่ผู้ขายโดยไม่มีดอกเบี้ย เมื่อผู้ขายพ้นจากข้อผูกพันและความรับผิดทั้งปวงตามสัญญานี้แล้ว</p>

<p class='tab2 t-16'><b>ข้อ ๑๑ การอบรม</b></p>
<p class='tab3 t-16'>ผู้ขายต้องจัดอบรมการใช้งานโปรแกรมคอมพิวเตอร์ตามสัญญานี้ให้แก่เจ้าหน้าที่ของผู้ซื้อให้
</br>เข้าใจและสามารถใช้งานโปรแกรมคอมพิวเตอร์ได้เป็นอย่างดี มีประสิทธิภาพ โดยจะต้องส่งหลักสูตรตารางฝึก
</br>อบรมและสถานที่ฝึกอบรมให้ผู้ซื้อหรือผู้บริหารจัดการดูแลโปรแกรมคอมพิวเตอร์ที่ผู้ซื้อแต่งตั้งพิจารณาเห็น
</br>ชอบเป็นหนังสือก่อนดำเนินการฝึกอบรมโดยต้องดำเนินการฝึกอบรมให้แล้วเสร็จภายใน {result.TrainingPeriodDays} วัน นับถัดจากวัน
</br>ที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โดยไม่คิดค่าใช้จ่ายในการจัดอบรมจากผู้ซื้อ รายละเอียดของการอบรมให้เป็นไปตามเอกสารแนบท้ายสัญญาผนวก ๔</p>

<p class='tab2 t-16'><b>ข้อ ๑๒ คู่มือการใช้โปรแกรมคอมพิวเตอร์และการให้คำแนะนำ</b></p>
<p class='tab3 t-16'>๑๒.๑ ผู้ขายต้องจัดหาคู่มือการใช้โปรแกรมคอมพิวเตอร์ซึ่งเป็นต้นฉบับ จำนวน {result.ComputerManualsCount} ชุด ให้เป็น
</br>กรรมสิทธิ์ของผู้ซื้อตามรายละเอียดที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ พร้อมทั้งจะต้องปรับปรุง
</br>คู่มือดังกล่าวให้ทันสมัยทุกครั้งที่มีการปรับปรุงโปรแกรมคอมพิวเตอร์ให้ทันสมัยขึ้นตลอดระยะเวลารับ
</br>ประกันตามข้อ ๙.๒ และต้องให้คำแนะนำในการใช้โปรแกรมคอมพิวเตอร์และคู่มือการใช้โปรแกรม
</br>คอมพิวเตอร์เมื่อมีการปรับปรุงโปรแกรมคอมพิวเตอร์ดังกล่าว หรือเมื่อผู้ซื้อร้องขอตลอดเวลาระยะเวลา
</br>รับประกันโดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ</p>

<p class='tab3 t-16'>๑๒.๒ ผู้ขายต้องให้คำแนะนำแก่ผู้ซื้อในการใช้โปรแกรมคอมพิวเตอร์และคู่มือการใช้โปร
</br>แกรมคอมพิวเตอร์ รวมทั้งจะต้องดำเนินการต่างๆ เกี่ยวกับโปรแกรมคอมพิวเตอร์ ในลักษณะของการให้
</br>บริการหลังการขาย ทั้งนี้ เพื่อให้โปรแกรมคอมพิวเตอร์สามารถทำงานได้อย่างสมบูรณ์ ตลอดระยะเวลาการรับ
</br>ประกันตามข้อ ๙.๒ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ รายละเอียดเป็นไปตามที่กำหนดในเอกสารแนบท้าย
</br>สัญญาผนวก ๕ แนบท้ายสัญญานี้</p>

<p class='tab2 t-16'><b>ข้อ ๑๓ การรักษาความลับทางการค้า</b></p>
<p class='tab3 t-16'>๑๓.๑ ผู้ซื้อจะไม่เปิดเผยในลักษณะที่จะก่อให้เกิดความเสียหายแก่ผู้ขาย ให้บุคคลอื่นทราบซึ่ง
ข้อมูลหรือเทคนิคเกี่ยวกับโปรแกรมคอมพิวเตอร์ ซึ่งผู้ขายประสงค์ให้เป็นความลับทางการค้าของผู้ขาย และ
</br>ผู้ขายได้แจ้งให้ผู้ซื้อทราบเป็นหนังสือแล้ว</p>
<p class='tab3 t-16'>๑๓.๒ ผู้ขาย ลูกจ้าง ตัวแทนหรือพนักงานของผู้ขายจะต้องไม่เอาไป เปิดเผย หรือใช้ข้อมูล
</br>และ/หรือสารสนเทศของผู้ซื้อ หรือกระทำด้วยประการใดๆ ให้บุคคลอื่นเอาไป เปิดเผย หรือใช้ข้อมูลและ/หรือ
</br>สารสนเทศของผู้ซื้อ หรือเข้าถึงโดยมิชอบซึ่งข้อมูลและ/หรือสารสนเทศของผู้ซื้อผ่านโปรแกรมคอมพิวเตอร์
</br>และระบบคอมพิวเตอร์ หรือล่วงรู้มาตรการป้องกันการเข้าถึงข้อมูลและ/หรือสารสนเทศของ ผู้ซื้อผ่าน
</br>โปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์ที่จัดทำขึ้นเป็นการเฉพาะ หรือกระทำด้วยประการใดๆ โดยมิ
</br>ชอบด้วยวิธีการทางอิเล็กทรอนิกส์เพื่อดักรับไว้ซึ่งข้อมูลและ/หรือสารสนเทศของผู้ซื้อหรือผู้ที่เกี่ยวข้องกับผู้ซื้อ
</br>ที่อยู่ระหว่างการส่งผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์โดยไม่ชอบด้วยกฎหมาย หรือโดยไม่ได้
</br>รับความยินยอมเป็นหนังสือจากผู้ซื้อ</p>

<div style='page-break-before: always;'></div>
<p class='tab2 t-16'><b>ข้อ ๑๔ ความคุ้มครองเกี่ยวกับลิขสิทธิ์</b></p>
<p class='tab3 t-16'>ในกรณีที่บุคคลภายนอกกล่าวอ้างหรือใช้สิทธิเรียกร้องใดๆ ว่ามีการละเมิดลิขสิทธิ์หรือสิทธิ
</br>บัตรหรือสิทธิใดๆ เกี่ยวกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้ โดยผู้ซื้อมิได้แก้ไขดัดแปลงไปจากเดิม หรือ
</br>แก้ไขดัดแปลงโดยได้รับความยินยอมจากผู้ขายเป็นหนังสือ หรือเป็นกรณีที่กฎหมายอนุญาตให้ทำได้ ผู้ขาย
</br>จะต้องปกป้องผู้ซื้อและดำเนินการทั้งปวงเพื่อให้การกล่าวอ้างหรือการเรียกร้องดังกล่าวระงับสิ้นไปโดยเร็วเพื่อ
</br>ให้ผู้ซื้อสามารถใช้โปรแกรมคอมพิวเตอร์นั้นต่อไปได้ ขั้นตอนดังกล่าวอาจรวมถึงการคืนโปรแกรมคอมพิวเตอร์
</br>เดิมและเปลี่ยนโปรแกรมคอมพิวเตอร์ที่มีคุณสมบัติไม่ต่ำกว่าโปรแกรมคอมพิวเตอร์เดิมให้ใหม่ระยะเวลาที่เสีย
</br>ไปดังกล่าวไม่นับรวมเป็นระยะเวลาใช้สิทธิตามสัญญา หากผู้ขายไม่อาจกระทำได้และผู้ซื้อต้องรับผิดชดใช้ค่า
</br>เสียหายต่อบุคคลภายนอกเนื่องจากผลแห่งการละเมิดลิขสิทธิ์ดังกล่าวผู้ขายต้องเป็นผู้ชำระค่าเสียหาย ค่าปรับ 
</br>และค่าใช้จ่ายอื่นๆ รวมทั้งค่าฤชาธรรมเนียมและค่าทนายความแทนผู้ซื้อ ทั้งนี้ ผู้ซื้อจะแจ้งให้ผู้ขายทราบเป็น
</br>หนังสือในเมื่อได้มีการกล่าวอ้างหรือใช้สิทธิเรียกร้องดังกล่าวโดยไม่ชักช้า</p>

<p class='tab2 t-16'><b>ข้อ ๑๕ โปรแกรมคอมพิวเตอร์ที่ได้รับการแก้ไขพัฒนาให้ดีขึ้น</b></p>
<p class='tab3 t-16'>ผู้ขายมีหน้าที่ต้องเสนอโปรแกรมคอมพิวเตอร์ที่ได้รับการพัฒนาให้ทันสมัยเป็นปัจจุบันและดี
</br>ขึ้นจากรากฐานโปรแกรมคอมพิวเตอร์ตามสัญญานี้ หรือจากรากฐานโปรแกรมคอมพิวเตอร์อื่นที่เกี่ยวพันกับ
</br>โปรแกรมคอมพิวเตอร์ตามสัญญานี้แก่ผู้ซื้อ และผู้ซื้อมีสิทธิใช้โปรแกรมคอมพิวเตอร์รุ่นที่พัฒนาทันสมัยเป็น
</br>ปัจจุบันและดีขึ้นแล้วนี้ด้วย โดยผู้ซื้อไม่ต้องจ่ายค่าตอบแทนเพิ่มขึ้นและ/หรือจะต้องจ่ายค่าตอบแทน ให้ผู้ขาย
</br>ตามจำนวนที่จะตกลงกันตามเอกสารแนบท้ายสัญญาผนวก ๖</p>
<p class='tab3 t-16'>การที่ผู้ซื้อเลือกที่จะใช้โปรแกรมคอมพิวเตอร์ที่ได้พัฒนาตามวรรคหนึ่งแล้ว ไม่มีผลกระทบต่อข้อสัญญาอื่นๆ</p>

<p class='tab2 t-16'><b>ข้อ ๑๖ การบอกเลิกสัญญา</b></p>
<p class='tab3 t-16'>เมื่อครบกำหนดส่งมอบโปรแกรมคอมพิวเตอร์ตามข้อ ๕ แล้ว ถ้าผู้ขายไม่ส่งมอบโปรแกรม
</br>คอมพิวเตอร์ให้แก่ผู้ซื้อถูกต้องครบถ้วนภายในกำหนดเวลาดังกล่าว หรือส่งมอบโปรแกรมคอมพิวเตอร์ไม่ตรง
</br>ตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก ๑
</br>และผนวก ๒ และเงื่อนไขต่างๆของสัญญานี้ หรือส่งมอบภายในกำหนดแต่ใช้งานไม่ได้ครบถ้วนตามข้อ ๕ 
</br>หรือผู้ขายผิดสัญญาข้อใดข้อหนึ่ง ผู้ซื้อมีสิทธิบอกเลิกสัญญาทั้งหมดหรือแต่บางส่วนได้การใช้สิทธิบอกเลิก
</br>สัญญานั้นไม่กระทบสิทธิของผู้ซื้อที่จะเรียกร้องค่าเสียหายจากผู้ขาย</p>

<p class='tab3 t-16'>ในกรณีที่ผู้ซื้อใช้สิทธิบอกเลิกสัญญา ผู้ซื้อมีสิทธิริบหรือบังคับจากหลักประกันตามข้อ ๑๐ 
</br>เป็นจำนวนเงินทั้งหมดหรือแต่บางส่วนก็ได้ แล้วแต่ผู้ซื้อจะเห็นสมควร ตลอดจนมีสิทธิเรียกค่าเสียหายใดๆ 
</br>อันเนื่องมาจากผู้ขายไม่ปฏิบัติตามสัญญานี้ และถ้าผู้ซื้อจัดซื้อโปรแกรมคอมพิวเตอร์จากบุคคลอื่น เต็มจำนวน
</br>หรือเฉพาะจำนวนที่ขาดส่งแล้วแต่กรณีภายในกำหนด {result.TeminationNewMonths} เดือน นับถัดจากวันบอกเลิกสัญญา ผู้ขายจะต้อง
</br>ชดใช้ราคาที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานี้ด้วย</p>

<div style='page-break-before: always;'></div>
<p class='tab2 t-16'><b>ข้อ ๑๗ ค่าปรับ</b></p>
<p class='tab3 t-16'>ในกรณีที่ผู้ซื้อยังไม่ใช้สิทธิบอกเลิกสัญญาตามข้อ ๑๖ ผู้ขายจะต้องชำระค่าปรับให้ ผู้ซื้อเป็น
</br>รายวันในอัตราร้อยละ {result.FinePerDaysPercent} ของราคาโปรแกรมคอมพิวเตอร์ที่ยังไม่ได้รับมอบนับถัดจากวันครบกำหนดตาม
</br>สัญญา จนถึงวันที่ผู้ขายได้นำโปรแกรมคอมพิวเตอร์มาส่งมอบให้แก่ผู้ซื้อจนถูกต้องครบถ้วน</p>
<p class='tab3 t-16'>การคิดค่าปรับในกรณีผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ที่ตกลงซื้อขายและอนุญาตให้
</br>ใช้สิทธิเพียงบางส่วนหรือขาดส่วนประกอบส่วนใดส่วนหนึ่งไป หรือส่งมอบโปรแกรมคอมพิวเตอร์ทั้งหมด 
</br>แต่ใช้งานไม่ได้ถูกต้องครบถ้วนตามข้อ ๕ ซึ่งส่งผลให้ระบบคอมพิวเตอร์ทั้งหมดใช้งานไม่ได้ ให้ถือว่ายัง
</br>ไม่ได้ส่งมอบโปรแกรมคอมพิวเตอร์นั้นเลย และให้คิดค่าปรับเป็นรายวันจากราคาโปรแกรมคอมพิวเตอร์ทั้งชุด</p>

<p class='tab3 t-16'>ในระหว่างที่ผู้ซื้อไม่ได้ใช้สิทธิบอกเลิกสัญญานั้น ถ้าผู้ซื้อเห็นว่าผู้ขายไม่อาจปฏิบัติตามสัญญา
</br>ต่อไปได้ ผู้ซื้อจะใช้สิทธิบอกเลิกสัญญาและริบหรือบังคับจากหลักประกันตามข้อ ๑๐ กับเรียกร้องให้ชดใช้
</br>ราคาที่เพิ่มขึ้นตามที่กำหนดไว้ในข้อ ๑๖ วรรคสอง ก็ได้ และถ้าผู้ซื้อได้แจ้งข้อเรียกร้องให้ชำระค่าปรับไปยัง
</br>ผู้ขายเมื่อครบกำหนดส่งมอบแล้ว ผู้ซื้อมีสิทธิที่จะปรับผู้ขายจนถึงวันบอกเลิกสัญญาได้อีกด้วย</p>

<p class='tab2 t-16'><b>ข้อ ๑๘ การบังคับค่าปรับ ค่าเสียหาย และค่าใช้จ่าย</b></p>
<p class='tab3 t-16'>ในกรณีที่ผู้ขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่งด้วยเหตุใดๆ ก็ตาม จนเป็นเหตุให้เกิดค่าปรับ
</br>ค่าเสียหาย หรือค่าใช้จ่ายแก่ผู้ซื้อ ผู้ขายต้องชดใช้ค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายดังกล่าวให้แก่ผู้ซื้อโดย
</br>สิ้นเชิงภายในกำหนด {result.EnforcementOfFineDays} วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ หากผู้ขายไม่ชดใช้ให้ถูกต้องครบ
</br>ถ้วนภายในระยะเวลาดังกล่าว ให้ผู้ซื้อมีสิทธิที่จะหักเอาจากจำนวนเงินค่าโปรแกรมคอมพิวเตอร์ที่ต้องชำระ
</br>หรือบังคับจากหลักประกันการปฏิบัติตามสัญญาได้ทันที</p>

<p class='tab3 t-16'>หากค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายที่บังคับจากเงินค่าโปรแกรมคอมพิวเตอร์ ที่ต้องชำระ 
</br>หรือหลักประกันการปฏิบัติตามสัญญาแล้วยังไม่เพียงพอ ผู้ขายยินยอมชำระส่วนที่เหลือ ที่ยังขาดอยู่จนครบ
</br>ถ้วนตามจำนวนค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายนั้น ภายในกำหนด {result.OutstandingPeriodDays} วัน นับถัดจากวันที่ได้รับแจ้งเป็น
</br>หนังสือจากผู้ซื้อ</p>
<p class='tab3 t-16'>หากมีเงินค่าโปรแกรมคอมพิวเตอร์ตามสัญญาที่หักไว้จ่ายเป็นค่าปรับ ค่าเสียหาย หรือค่าใช้
</br>จ่ายแล้วยังเหลืออยู่อีกเท่าใด ผู้ซื้อจะคืนให้แก่ผู้ขายทั้งหมด</p>

<p class='tab2 t-16'>(๒๑) <b>ข้อ ๑๙ การส่งคืนโปรแกรมคอมพิวเตอร์</b></p>
<p class='tab3 t-16'>เมื่อสัญญาสิ้นสุดลง ไม่ว่าจะในกรณีที่มีการเลิกสัญญา หรือกรณีครบกำหนดระยะเวลาการ
</br>อนุญาตให้ใช้สิทธิ หากผู้ขายมีหนังสือร้องขอภายในกำหนดเวลา {result.ComputerSendBackDays} วัน นับถัดจากวันที่สัญญาสิ้นสุดลงผู้ซื้อจะส่ง
</br>คืนโปรแกรมคอมพิวเตอร์และสำเนาโปรแกรมคอมพิวเตอร์ตามสัญญานี้คืนให้กับผู้ขาย หากผู้ขายไม่ร้องขอ
</br>ภายในกำหนดเวลาดังกล่าว ให้ถือว่าสละสิทธิการรับคืนโปรแกรมคอมพิวเตอร์ตามสัญญานี้</p>

<p class='tab2 t-16'><b>ข้อ ๒๐ การงดหรือลดค่าปรับ หรือขยายเวลาส่งมอบ</b></p>
<p class='tab3 t-16'>ในกรณีที่มีเหตุสุดวิสัย หรือเหตุใดๆ อันเนื่องมาจากความผิดหรือความบกพร่องของฝ่ายผู้ซื้อ
หรือจากพฤติการณ์อันหนึ่งอันใดที่ผู้ขายไม่ต้องรับผิดตามกฎหมาย หรือเหตุอื่นตามที่กำหนดในกฎกระทรวง
</br>ซึ่งออกตามความในกฎหมายว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ ทำให้ผู้ขายไม่สามารถส่งมอบ
</br>โปรแกรมคอมพิวเตอร์ตามเงื่อนไขและกำหนดเวลาแห่งสัญญานี้ได้ ผู้ขายมีสิทธิของดหรือลดค่าปรับหรือขยาย
</br>เวลาตามสัญญาได้โดยจะต้องแจ้งเหตุหรือพฤติการณ์ดังกล่าวพร้อมหลักฐานเป็นหนังสือให้ผู้ซื้อทราบภายใน
</br> ๑๕ (สิบห้า) วัน นับถัดจากวันที่เหตุนั้นสิ้นสุดลง หรือตามที่กำหนดในกฎกระทรวงดังกล่าว แล้วแต่กรณี
</p>
<p class='tab3 t-16'>ถ้าผู้ขายไม่ปฏิบัติให้เป็นไปตามความในวรรคหนึ่ง ให้ถือว่าผู้ขายได้สละสิทธิเรียกร้องในการที่
จะของดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญา โดยไม่มีเงื่อนไขใดๆ ทั้งสิ้น เว้นแต่กรณีเหตุเกิดจาก
</br>ความผิดหรือความบกพร่องของฝ่ายผู้ซื้อซึ่งมีหลักฐานชัดแจ้งหรือผู้ซื้อทราบดีอยู่แล้วตั้งแต่ต้น</p>
<p class='tab3 t-16'>การงดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญาตามวรรคหนึ่ง อยู่ในดุลพินิจของผู้ซื้อที่จะพิจารณาตามที่เห็นสมควร</p>
<p class='tab3 t-16'>สัญญานี้ทำขึ้นสองฉบับ มีข้อความถูกต้องตรงกัน คู่สัญญาได้อ่านและเข้าใจข้อความโดย
</br>ละเอียดตลอดแล้ว จึงได้ลงลายมือชื่อพร้อมทั้งประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยาน และคู่สัญญาต่าง
</br>ยึดถือไว้ฝ่ายละหนึ่งฉบับ</p>

</br>
</br>
{signatoryHtml}
    
<div style='page-break-before: always;'></div>
<p class='text-center t-22' style='font-weight:bold;'>วิธีปฏิบัติเกี่ยวกับสัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์</p>
<p class='tab2 t-16'>(1) ให้ระบุเลขที่สัญญาในปีงบประมาณหนึ่งๆ ตามลำดับ</p>
<p class='tab2 t-16'>(2) ให้ระบุชื่อของหน่วยงานของรัฐที่เป็นนิติบุคคล เช่น กรม ก. หรือรัฐวิสาหกิจ ข. เป็นต้น</p>
<p class='tab2 t-16'>(3) ให้ระบุชื่อและตำแหน่งของหัวหน้าหน่วยงานของรัฐที่เป็นนิติบุคคลนั้น หรือผู้ที่ได้รับมอบ
</br>อำนาจ เช่น นาย ก. อธิบดีกรม………...… หรือ นาย ข. ผู้ได้รับมอบอำนาจจากอธิบดีกรม………......………..</p>
<p class='tab2 t-16'>(4) ให้ระบุชื่อผู้ให้เช่า</p>
<p class='tab3 t-16'>ก. กรณีนิติบุคคล เช่น ห้างหุ้นส่วนสามัญจดทะเบียน ห้างหุ้นส่วนจำกัด บริษัทจำกัด</p>
<p class='tab3 t-16'>ข. กรณีบุคคลธรรมดา ให้ระบุชื่อและที่อยู่</p>
<p class='tab2 t-16'>(๕) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>(๖) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>(๗) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>(๘) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ ๓ วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่ไว้ตรวจรับของนั้น</p>
<p class='tab3 t-16'>ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย และในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน</p>
<p class='tab2 t-16'>(๙) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ ๓ วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่ไว้ตรวจรับของนั้น</p>
<p class='tab3 t-16'>ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย และในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน</p>
<p class='tab2 t-16'>(๑๐) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>๑๑) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>(๑๒) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>(13) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>(14) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะของสิ่งของ
</br>ที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย</p>
<p class='tab2 t-16'>(15) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะของสิ่ง
</br>ของที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย</p>
<p class='tab2 t-16'>(16) “หลักประกัน” หมายถึง หลักประกันที่ผู้รับจ้างนำมามอบไว้แก่หน่วยงานของรัฐเมื่อลงนามในสัญญาเพื่อประกันความเสียหายที่อาจเกิดขึ้นจากการปฏิบัติตามสัญญา ดังนี้</p>
<p class='tab3 t-16'>(๑)เงินสด </p>
<p class='tab3 t-16'>(๒)เช็คหรือดราฟท์ที่ธนาคารเซ็นสั่งจ่าย ซึ่งเป็นเช็คหรือดราฟท์ลงวันที่ที่ใช้เช็คหรือดราฟท์
</br>นั้นชำระต่อเจ้าหน้าที่ หรือก่อนวันนั้นไม่เกิน ๓ วันทำการ </p>
<p class='tab3 t-16'>(๓)หนังสือคํ้าประกันของธนาคารภายในประเทศตามตัวอย่างที่คณะกรรมการนโยบายกําหนด โดยอาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้</p>
<p class='tab3 t-16'>(๔)หนังสือค้ำประกันของบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้
</br>ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคารแห่งประเทศไทย 
</br>ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบ โดยอนุโลมให้ใช้ตามตัวอย่างหนังสือค้ำ
</br>ประกันของธนาคารที่คณะกรรมการนโยบายกําหนด</p>
<p class='tab3 t-16'>(๕)พันธบัตรรัฐบาลไทย</p>
<p class='tab2 t-16'>(๑๗) ให้กำหนดจำนวนเงินหลักประกันการปฏิบัติตามสัญญาตามระเบียบกระทรวงการคลังว่าด้วย
</br>การจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๘ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสาร
</br>ประกวดราคาด้วย</p>
<p class='tab2 t-16'>(๑๘) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
<p class='tab2 t-16'>(๑๙) กำหนดเวลาที่ผู้ซื้อจะซื้อสิ่งของจากแหล่งอื่นเมื่อบอกเลิกสัญญาและมีสิทธิเรียกเงินในส่วนที่
</br>เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานั้น ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย</p>
<p class='tab2 t-16'>(๒๑) อัตราค่าปรับตามสัญญาข้อ ๑๗ ให้กำหนดเป็นรายวันในอัตราตายตัวระหว่างร้อยละ
</br>๐.๐๑ – ๐.๒๐ ของราคาพัสดุที่ยังไม่ได้ส่งมอบ ตามระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้างและการ
</br>บริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๒ ส่วนกรณีจะปรับร้อยละเท่าใด ให้อยู่ในดุลพินิจของหน่วยงานของ
</br>รัฐผู้ซื้อที่จะพิจารณา โดยคำนึงถึงราคาและลักษณะของพัสดุที่ซื้อ ซึ่งอาจมีผลกระทบต่อการที่ผู้ขายจะหลีก
</br>เลี่ยงไม่ปฏิบัติตามสัญญา แต่ทั้งนี้ การที่จะกำหนดค่าปรับเป็นร้อยละเท่าใดจะต้องกำหนดไว้ในเอกสารเชิญ
</br>ชวนด้วย
</p>
<p class='tab2 t-16'>(๒๑) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้
</br>ตามข้อเท็จจริง</p>
</ div >
";

                var html = $@"<html>
<head>
    <meta charset='utf-8'>
  
     <style>
        @font-face {{
            font-family: 'THSarabunNew';
            src: url('file:///{fontPath}') format('truetype');
            font-weight: normal;
            font-style: normal;
        }}
         body {{
            font-size: 22px;
            font-family: 'THSarabunNew', Arial, sans-serif;
         
        }}
        .t-16 {{
            font-size: 1.5em;
        }}
        .t-18 {{
            font-size: 1.7em;
        }}
        .t-22 {{
            font-size: 1.9em;
        }}
        .tab1 {{ text-indent: 48px;  word-break: break-all;  }}
        .tab2 {{ text-indent: 96px;  word-break: break-all; }}
        .tab3 {{ text-indent: 144px;  word-break: break-all; }}
        .tab4 {{ text-indent: 192px;  word-break: break-all;}}
        .d-flex {{ display: flex; }}
        .w-100 {{ width: 100%; }}
        .w-40 {{ width: 40%; }}
        .w-50 {{ width: 50%; }}
        .w-60 {{ width: 60%; }}
        .text-center {{ text-align: center; }}
        .sign-single-right {{
            display: flex;
            flex-direction: column;
            position: relative;
            left: 20%;
        }}
        .table {{ width: 100%; border-collapse: collapse; margin-top: 20px; font-size: 28pt; }}
        .table th, .table td {{ border: 1px solid #000; padding: 8px; }}

        .sign-double {{ display: flex; }}
        .text-center-right-brake {{
            margin-left: 50%;
            word-break: break-all;
        }}
        .text-right {{ text-align: right; }}
        .contract, . {{
            margin: 12px 0;
            line-height: 1.7;
        }}
        . {{
            font-weight: bold;
            font-size: 1.2em;
            text-align: left;
            margin-top: 24px;
        }}
        .signature-table {{
            width: 100%;
            margin-top: 32px;
            border-collapse: collapse;
        }}
        .signature-table td {{
            padding: 16px;
            text-align: center;
            vertical-align: top;
            font-size: 1.1em;
        }}
     .logo-table {{ width: 100%; border-collapse: collapse; margin-top: 40px; }}
        .logo-table td {{ border: none; }}
     p {{
            margin: 0;
            padding: 0;
        }}

    </style>
</head>
<body>
    {htmlBody}
</body>
</html>
";

        //        if (_pdfConverter == null)
        //            throw new Exception("PDF service is not available.");

        //        var doc = new HtmlToPdfDocument()
        //        {
        //            GlobalSettings = {
        //    PaperSize = PaperKind.A4,
        //    Orientation = DinkToPdf.Orientation.Portrait,
        //    Margins = new MarginSettings
        //    {
        //        Top = 20,
        //        Bottom = 20,
        //        Left = 20,
        //        Right = 20
        //    }
        //},
        //            Objects = {
        //    new ObjectSettings() {
        //        HtmlContent = html,
        //        FooterSettings = new FooterSettings
        //        {
        //            FontName = "THSarabunNew",
        //            FontSize = 6,
        //            Line = false,
        //            Center = "[page] / [toPage]"
        //        }
        //    }
        //}
        //        };

        //        var pdfBytes = _pdfConverter.Convert(doc);
                return html;

            }
        }
        catch (Exception ex)
        {
            throw new Exception("SLA 308-60 data not found.");
        }
       

    }
    #endregion 4.1.1.2.10.สัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ ร.308-60

}
