using DocumentFormat.OpenXml.Packaging;
using DocumentFormat.OpenXml.Wordprocessing;


public class WordEContract_BuyOrSellComputerService
{
    private readonly WordServiceSetting _w;

    public WordEContract_BuyOrSellComputerService(WordServiceSetting ws)
    {
        _w = ws;
    }
# region 4.1.1.2.11.สัญญาเช่าคอมพิวเตอร์ ร.309-60
    public byte[] OnGetWordContact_BuyOrSellComputerService()
    {

        var stream = new MemoryStream();

        using (var wordDoc = WordprocessingDocument.Create(stream, DocumentFormat.OpenXml.WordprocessingDocumentType.Document, true))
        {
            var mainPart = wordDoc.AddMainDocumentPart();
            mainPart.Document = new DocumentFormat.OpenXml.Wordprocessing.Document();

            // Styles
            var stylePart = mainPart.AddNewPart<StyleDefinitionsPart>();
            stylePart.Styles = WordServiceSetting.CreateDefaultStyles();

            var body = mainPart.Document.AppendChild(new Body());

            body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("แบบสัญญา", "000000", "36"));
            body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("สัญญาซื้อขายคอมพิวเตอร์", "000000", "36"));
            // 2. Document title and subtitle
            body.AppendChild(WordServiceSetting.EmptyParagraph());
            body.AppendChild(WordServiceSetting.RightParagraph("สัญญาเลขที่………….…… (1)...........……..……..."));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("สัญญาฉบับนี้ทำขึ้น ณ ………….……..…………………………………………………………………………......."));
            body.AppendChild(WordServiceSetting.JustifiedParagraph("ตำบล/แขวง…………………..………………….………………. อำเภอ/เขต……………………….….……………………………...\r\n" +
            "จังหวัด…….…………………………….………….เมื่อวันที่ ……….……… เดือน …………………….. พ.ศ. ……....……… \r\n" +
            "ระหว่าง……………………………………………………………… (2) ………………………………………………………………………..\r\n" +
            "โดย………...…………….…………………………….……………(3) ………..…………………………………………..…………………\r\n" +
            "ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ซื้อ” ฝ่ายหนึ่ง กับ…………….…………..…… (4 ก) …………..…………………….\r\n" +
            "ซึ่งจดทะเบียนเป็นนิติบุคคล ณ ……………………………………………………………………………………….………….……..มี\r\n" +
            "สำนักงานใหญ่อยู่เลขที่ ……………......……ถนน……………….……………..ตำบล/แขวง…….……….…..……….…....\r\n" +
            "อำเภอ/เขต………………….…..…….จังหวัด………..…………………..….โดย………….…………………………………..……...\r\n" +
            "มีอำนาจลงนามผูกพันนิติบุคคลปรากฏตามหนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท ……………\r\n" +
            "ลงวันที่………………………………..… (5)(และหนังสือมอบอำนาจลงวันที่ ……………….……..) แนบท้ายสัญญานี้\r\n" +
            "(6)(ในกรณีที่ผู้รับจ้างเป็นบุคคลธรรมดาให้ใช้ข้อความว่า กับ …………………..….… (4 ข) …………………….............\r\n" +
            "อยู่บ้านเลขที่ …………….….…..….ถนน…………………..……..…...……ตำบล/แขวง ……..………………….….…………\r\n" +
            "อำเภอ/เขต…………………….………….…..จังหวัด…………...…..………….……...……. ผู้ถือบัตรประจำตัวประชาชน\r\n" +
            "เลขที่................................ ดังปรากฏตามสำเนาบัตรประจำตัวประชาชนแนบท้ายสัญญานี้) ซึ่งต่อไปใน\r\n" +
            "สัญญานี้เรียกว่า “ผู้ให้เช่า” อีกฝ่ายหนึ่ง", "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ1 คำนิยาม", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ซื้อตกลงซื้อและผู้ขายตกลงขายและติดตั้งเครื่องคอมพิวเตอร์ อุปกรณ์การประมวลผล \r\n" +
                "ระบบคอมพิวเตอร์ ซึ่งเป็นผลิตภัณฑ์ของ…………….……………….……………..…(๗)…………………..….…………………………" +
                "ซึ่งต่อไปในสัญญานี้เรียกว่า “คอมพิวเตอร์” ตามรายละเอียดเอกสารแนบท้ายสัญญาผนวก ๑ รวมเป็นราคาคอมพิวเตอร์และค่าติดตั้งทั้งสิ้น……………….…………บาท (………………….…………….……..)" +
                "ซึ่งได้รวมภาษีมูลค่าเพิ่ม จำนวน………………….…....…บาท (…………………..……..………..) ตลอดจนภาษีอากรอื่นๆ และค่าใช้จ่ายทั้งปวงด้วยแล้ว", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ขายประสงค์จะนำคอมพิวเตอร์และอุปกรณ์รายการใดแตกต่างไปจากรายละเอียดที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก๑ มาติดตั้งให้ผู้ซื้อ ผู้ขายจะต้องได้รับความเห็นชอบ\r\n" +
                "เป็นหนังสือจากผู้ซื้อก่อน และคอมพิวเตอร์ที่จะนำมาติดตั้งดังกล่าวนั้นจะต้องมีคุณสมบัติไม่ต่ำกว่าที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก" +
                "๑ และ ๒ ทั้งนี้ จะต้องไม่คิดราคาเพิ่มจากผู้ซื้อไม่ว่าในกรณีใด\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๒ \tการรับรองคุณภาพ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายรับรองว่าคอมพิวเตอร์ที่ขายให้ตามสัญญานี้เป็นของแท้ ของใหม่ ไม่ใช่เครื่องที่ใช้งาน\r\nแล้วนำมาปรับปรุงสภาพขึ้นใหม่และมีคุณสมบัติไม่ต่ำกว่าที่กำหนดไว้ตามรายละเอียด และคุณลักษณะเฉพาะ\r\nของคอมพิวเตอร์ที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๒\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๓ \tเอกสารอันเป็นส่วนหนึ่งของสัญญา", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เอกสารแนบท้ายสัญญาดังต่อไปนี้ ให้ถือเป็นส่วนหนึ่งของสัญญานี้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๑ \tผนวก ๑............(รายการคอมพิวเตอร์ที่ซื้อขาย)................\tจำนวน……..(.……….) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๒ \tผนวก ๒...............(รายการคุณลักษณะเฉพาะ)..................\tจำนวน……..(.……….) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๓\tผนวก ๓..(รายละเอียดการทดสอบการใช้งานคอมพิวเตอร์)..\tจำนวน……..(.……….) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๔ \tผนวก ๔........(การกำหนดตัวถ่วงของคอมพิวเตอร์)...........\tจำนวน……..(.……….) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๕ \tผนวก ๕........(การอบรมวิชาการด้านคอมพิวเตอร์)..........\tจำนวน……..(.……….) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๖ \tผนวก ๖.....(รายการเอกสารคู่มือการใช้คอมพิวเตอร์).......\tจำนวน……..(.……….) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs(".........................................ฯลฯ....................................", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ความใดในเอกสารแนบท้ายสัญญาที่ขัดหรือแย้งกับข้อความในสัญญานี้ ให้ใช้ข้อความ\r\n" +
                "ในสัญญานี้บังคับ และในกรณีที่เอกสารแนบท้ายสัญญาขัดแย้งกันเอง ผู้ขายจะต้องปฏิบัติตามคำวินิจฉัยของผู้ซื้อ คำวินิจฉัยของผู้ซื้อให้ถือเป็นที่สุด และผู้ขายไม่มีสิทธิเรียกร้องราคา ค่าเสียหาย หรือค่าใช้จ่ายใด ๆ เพิ่มเติมจากผู้ซื้อทั้งสิ้น\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๔ \tการส่งมอบและติดตั้ง", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายจะส่งมอบและติดตั้งคอมพิวเตอร์ที่ซื้อขายตามสัญญานี้ให้ถูกต้องและครบถ้วนตามที่กำหนดไว้ในข้อ ๑ ให้พร้อมที่จะใช้งานได้ตามรายละเอียดการทดสอบการใช้งานคอมพิวเตอร์ เอกสารแนบท้ายสัญญาผนวก๓" +
                "ให้แก่ผู้ซื้อ ณ ............................................................................. และส่งมอบให้แก่ผู้ซื้อภายใน…………(………….….) วัน นับถัดจากวันลงนามในสัญญา", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายจะต้องแจ้งกำหนดเวลาติดตั้งแล้วเสร็จพร้อมที่จะใช้งานและส่งมอบคอมพิวเตอร์ได้\r\n" +
                "โดยทำเป็นหนังสือยื่นต่อผู้ซื้อ ณ ……..…………………………………...…………………………ในวันและเวลาทำการของผู้ซื้อก่อนวันกำหนดส่งมอบไม่น้อยกว่า………..……(…...…....….) วันทำการของผู้ซื้อ\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายต้องออกแบบสถานที่ติดตั้งคอมพิวเตอร์รวมทั้งระบบอื่นๆ ที่เกี่ยวข้องตามมาตรฐานของผู้ขายและได้รับความเห็นชอบจากผู้ซื้อเป็นหนังสือ และผู้ขายต้องจัดหาเจ้าหน้าที่มาให้คำแนะนำและตรวจสอบความถูกต้องเหมาะสมของสถานที่ให้ทันต่อการติดตั้งคอมพิวเตอร์โดยไม่คิดค่าใช้จ่ายใด ๆ จากผู้ซื้อภายใน……………(…………….….) วัน นับถัดจากวันลงนามในสัญญา", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๕ \tการตรวจรับ", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อผู้ซื้อได้ตรวจรับคอมพิวเตอร์ที่ส่งมอบและติดตั้งแล้วเห็นว่าถูกต้องครบถ้วนตามสัญญานี้แล้ว ผู้ซื้อจะออกหลักฐานการรับมอบไว้เป็นหนังสือ เพื่อผู้ขายนำมาใช้เป็นหลักฐานประกอบการขอรับเงินค่าคอมพิวเตอร์ ตามที่ระบุไว้ในข้อ ๖", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผลของการตรวจรับปรากฏว่า คอมพิวเตอร์ที่ผู้ขายส่งมอบไม่ตรงตามข้อ ๑ หรือมีคุณสมบัติไม่ถูกต้องตามข้อ ๒ หรือใช้งานได้ไม่ครบถ้วนตามข้อ ๔ ผู้ซื้อทรงไว้ซึ่งสิทธิที่จะไม่รับคอมพิวเตอร์นั้น ในกรณี\r\nเช่นว่านี้ ผู้ขายต้องรีบนำคอมพิวเตอร์นั้นกลับคืนโดยเร็วที่สุดเท่าที่จะทำได้และนำคอมพิวเตอร์มาส่งมอบให้ใหม่ หรือต้องทำการแก้ไขให้ถูกต้องตามสัญญาด้วยค่าใช้จ่ายของผู้ขายเอง และระยะเวลาที่เสียไปเพราะเหตุดังกล่าวผู้ขายจะนำมาอ้างเป็นเหตุขอขยายเวลาทำการตามสัญญาหรือของดหรือลดค่าปรับไม่ได้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(8) ในกรณีที่ผู้ขายส่งมอบคอมพิวเตอร์ถูกต้องแต่ไม่ครบจำนวน หรือส่งมอบครบจำนวน\r\nแต่ไม่ถูกต้องทั้งหมด ผู้ซื้อจะตรวจรับเฉพาะส่วนที่ถูกต้อง โดยออกหลักฐานการตรวจรับเฉพาะส่วนนั้นก็ได้ (ความในวรรคสามนี้ จะไม่กำหนดไว้ในกรณีที่ผู้ซื้อต้องการคอมพิวเตอร์ทั้งหมดในคราวเดียวกัน หรือการซื้อคอมพิวเตอร์\r\nที่ประกอบเป็นชุดหรือหน่วย ถ้าขาดส่วนประกอบอย่างหนึ่งอย่างใดไปแล้ว จะไม่สามารถใช้งานได้โดยสมบูรณ์)\r\n", null, "32"));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๖ \tการชำระเงิน", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(9) ผู้ซื้อจะชำระเงินค่าคอมพิวเตอร์ให้แก่ผู้ขาย เมื่อผู้ซื้อได้รับมอบคอมพิวเตอร์ตาม\r\nข้อ ๕ ไว้โดยครบถ้วนแล้ว\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(10) ผู้ซื้อตกลงชำระเงินค่าคอมพิวเตอร์ให้แก่ผู้ขาย ดังนี้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๖.๑ เงินล่วงหน้า จำนวน ....................... บาท (......................................................) \r\n" +
                "จะจ่ายให้ภายใน ..................... (............................) วัน นับถัดจากวันลงนามในสัญญา ทั้งนี้ โดยผู้ขายจะต้อง\r\n" +
                "นำหลักประกันการรับเงินล่วงหน้าเป็น........................(หนังสือค้ำประกันหรือหนังสือค้ำประกันอิเล็กทรอนิกส์\r\n" +
                "ของธนาคารภายในประเทศหรือพันธบัตรรัฐบาลไทย)..............................เต็มตามจำนวนเงินล่วงที่ได้รับ \r\n" +
                "มามอบให้แก่ผู้ซื้อเป็นหลักประกันการชำระคืนเงินล่วงหน้าก่อนการรับชำระเงินล่วงหน้านั้น และผู้ซื้อจะคืนหลักประกันการรับเงินล่วงหน้าให้แก่ผู้ขาย เมื่อผู้ซื้อจ่ายเงินที่เหลือตามข้อ ๖.๒ แล้ว เว้นแต่ในกรณีดังต่อไปนี้ \r\n" +
                "ผู้ขายมีสิทธิขอคืนหลักประกันการรับเงินล่วงหน้าบางส่วนก่อนได้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑) กรณีผู้ขายได้วางหลักประกันการรับเงินล่วงหน้าไว้ฉบับเดียว หากผู้ซื้อได้หักเงินล่วงหน้า\r\n" +
                "ไปแล้ว ผู้ขายมีสิทธิขอคืนหลักประกันการรับเงินล่วงหน้าในส่วนที่ผู้ซื้อได้หักเงินล่วงหน้าไปแล้วนั้น โดยผู้ขายจะต้องนำหลักประกันการรับเงินล่วงหน้าฉบับใหม่ที่มีมูลค่าเท่ากับเงินล่วงหน้าที่เหลืออยู่มาวางให้แก่ผู้ซื้อ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("\t(๒) กรณีผู้ขายได้วางหลักประกันการรับเงินล่วงหน้าไว้หลายฉบับ ซึ่งแต่ละฉบับ\r\nมีมูลค่าเท่ากับจำนวนเงินล่วงหน้าที่ผู้ซื้อจะต้องหักไว้ในแต่ละงวด หากผู้ซื้อได้หักเงินล่วงหน้าในงวดใดแล้ว\r\nผู้ขายมีสิทธิขอคืนหลักประกันการรับเงินล่วงหน้าในงวดนั้นได้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๖.๒ เงินที่เหลือ จำนวน……......…….........บาท (…....…………...………………) จะจ่ายให้เมื่อผู้ซื้อได้รับคอมพิวเตอร์ตามข้อ ๕ ไว้โดยถูกต้องครบถ้วน และผู้ขายได้อบรมเจ้าหน้าที่ของผู้ซื้อตามข้อ ๑๐ เสร็จสิ้นแล้ว", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(11) การจ่ายเงินตามเงื่อนไขแห่งสัญญานี้ ผู้ซื้อจะโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขาย ชื่อธนาคาร…………………………………..……...………….สาขา………………..………..…………………………………..\r\nชื่อบัญชี…………………………..........…….....เลขที่บัญชี…….......……...………………….……. ทั้งนี้ ผู้ขายตกลงเป็นผู้รับภาระเงินค่าธรรมเนียม หรือค่าบริการอื่นใดเกี่ยวกับการโอน รวมทั้งค่าใช้จ่ายอื่นใด (ถ้ามี) ที่ธนาคารเรียกเก็บ\r\nและยินยอมให้มีการหักเงินดังกล่าวจากจำนวนเงินโอนในงวดนั้น ๆ (ความในวรรคนี้ใช้สำหรับกรณี\r\nที่หน่วยงานของรัฐจะจ่ายเงินตรงให้แก่ผู้ขาย (ระบบ Direct Payment) โดยการโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขายตามแนวทางที่กระทรวงการคลังหรือหน่วยงานของรัฐเจ้าของงบประมาณเป็นผู้กำหนด แล้วแต่กรณี)\r\n", null, "32"));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๗ \tการรับประกันความชำรุดบกพร่อง", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายตกลงรับประกันความชำรุดบกพร่องหรือขัดข้องของคอมพิวเตอร์และการติดตั้ง\r\n" +
                "ตามสัญญานี้เป็นเวลา……..…..(12)…....…...…(………..……….….….) ปี ……...…(……..…….……….) เดือน นับถัดจากวันที่" +
                "ผู้ซื้อได้รับมอบคอมพิวเตอร์ทั้งหมดโดยถูกต้องครบถ้วนตามสัญญา ถ้าภายในระยะเวลาดังกล่าวคอมพิวเตอร์ชำรุด" +
                "บกพร่องหรือขัดข้อง หรือใช้งานไม่ได้ทั้งหมดหรือแต่บางส่วน หรือเกิดความชำรุดบกพร่องหรือขัดข้องจากการติดตั้ง เว้นแต่ความชำรุดบกพร่องหรือขัดข้องดังกล่าวเกิดขึ้นจากความผิดของผู้ซื้อซึ่งไม่ได้เกิดขึ้นจากการใช้งานตามปกติ ผู้ขายจะต้องจัดการซ่อมแซมแก้ไขให้อยู่ในสภาพใช้การได้ดีดังเดิม โดยต้องเริ่มจัดการซ่อมแซมแก้ไขภายใน…………..……..(….....……………..) วัน นับถัดจากวันที่ได้รับแจ้งจากผู้ซื้อโดยไม่คิดค่าใช้จ่ายใด ๆ จากผู้ซื้อทั้งสิ้น \r\nถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายเองทั้งสิ้นแทนผู้ซื้อ\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายมีหน้าที่บำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์ให้อยู่ในสภาพใช้งานได้ดีอยู่เสมอตลอดระยะเวลาดังกล่าวในวรรคหนึ่งด้วยค่าใช้จ่ายของผู้ขาย โดยให้มีเวลาคอมพิวเตอร์ขัดข้องรวมตามเกณฑ์\r\nการคำนวณเวลาขัดข้องไม่เกินเดือนละ………….....…(….…....……...) ชั่วโมง หรือร้อยละ……….……..(………………….) ของเวลาใช้งานทั้งหมดของคอมพิวเตอร์ของเดือนนั้น แล้วแต่ตัวเลขใดจะมากกว่ากัน มิฉะนั้นผู้ขายต้องยอมให้\r\nผู้ซื้อคิดค่าปรับเป็นรายชั่วโมง ในอัตราร้อยละ..............(13)............. (..............................) ของราคาคอมพิวเตอร์ทั้งหมดตามสัญญานี้คิดเป็นเงิน..............บาท (....................) ต่อชั่วโมง ในช่วงเวลาที่ไม่สามารถใช้คอมพิวเตอร์ได้ในส่วนที่เกินกว่ากำหนดเวลาขัดข้องข้างต้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เกณฑ์การคำนวณเวลาขัดข้องของคอมพิวเตอร์ตามวรรคสอง ให้เป็นดังนี้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("- กรณีที่คอมพิวเตอร์เกิดขัดข้องพร้อมกันหลายหน่วย ให้นับเวลาขัดข้องของหน่วยที่มี\r\nตัวถ่วงมากที่สุดเพียงหน่วยเดียว\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("- กรณีความเสียหายอันสืบเนื่องมาจากความขัดข้องของคอมพิวเตอร์แตกต่างกัน เวลาที่ใช้ในการคำนวณค่าปรับจะเท่ากับเวลาขัดข้องของคอมพิวเตอร์หน่วยนั้นคูณด้วยตัวถ่วงซึ่งมีค่าต่างๆ ตามเอกสาร แนบท้ายสัญญาผนวก ๔", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การที่ผู้ซื้อทำการนั้นเอง หรือให้ผู้อื่นทำการนั้นแทนผู้ขาย ไม่ทำให้ผู้ขายหลุดพ้นจาก              ความรับผิดตามสัญญา หากผู้ขายไม่ชดใช้ค่าใช้จ่ายหรือค่าเสียหายตามที่ผู้ซื้อเรียกร้องผู้ซื้อมีสิทธิบังคับจากหลักประกันการปฏิบัติตามสัญญาได้", null, "32"));



            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๘ \tหลักประกันการปฏิบัติตามสัญญา", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในขณะทำสัญญานี้ผู้ขายได้นำหลักประกันเป็น……….….…... (14).………...................\r\nเป็นจำนวนเงิน……………….…….บาท (…………………..…...…....…....) ซึ่งเท่ากับร้อยละ………..….…(15)……...…...(…………………….…….……...........) ของราคาซื้อขายคอมพิวเตอร์ตามข้อ ๑ มามอบให้แก่ผู้ซื้อเพื่อเป็นหลักประกัน\r\nการปฏิบัติตามสัญญานี้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(16) กรณีผู้ขายใช้หนังสือค้ำประกันมาเป็นหลักประกันการปฏิบัติตามสัญญา หนังสือ\r\nค้ำประกันดังกล่าวจะต้องออกโดยธนาคารที่ประกอบกิจการในประเทศไทย หรือโดยบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกัน\r\nตามประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบตามแบบที่คณะกรรมการนโยบายการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐกำหนด หรืออาจเป็นหนังสือ\r\nค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้และจะต้องมีอายุการค้ำประกันตลอดไปจนกว่า\r\nผู้ขายพ้นข้อผูกพันตามสัญญานี้ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หลักประกันที่ผู้ขายนำมามอบให้ตามวรรคหนึ่ง จะต้องมีอายุครอบคลุมความรับผิดทั้งปวงของผู้ขายตลอดอายุสัญญา ถ้าหลักประกันที่ผู้ขายนำมามอบให้ดังกล่าวลดลงหรือเสื่อมค่าลง หรือมีอายุ\r\nไม่ครอบคลุมถึงความรับผิดของผู้ขายตลอดอายุสัญญา ไม่ว่าด้วยเหตุใดๆ ก็ตาม รวมถึงกรณีผู้ขายส่งมอบและติดตั้งคอมพิวเตอร์ล่าช้าเป็นเหตุให้ระยะเวลาแล้วเสร็จหรือวันครบกำหนดความรับผิดในความชำรุดบกพร่อง\r\nตามสัญญาเปลี่ยนแปลงไป ไม่ว่าจะเกิดขึ้นคราวใด ผู้ขายต้องหาหลักประกันใหม่หรือหลักประกันเพิ่มเติมให้มีจำนวนครบถ้วนตามวรรคหนึ่ง มามอบให้แก่ผู้ซื้อภายใน........................(…………..….…..….) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หลักประกันที่ผู้ขายนำมามอบไว้ตามข้อนี้ ผู้ซื้อจะคืนให้แก่ผู้ขายโดยไม่มีดอกเบี้ยเมื่อผู้ขายพ้นจากข้อผูกพันและความรับผิดทั้งปวงตามสัญญานี้แล้ว", null, "32"));
       

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๙ \tการโอนกรรมสิทธิ์", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("คู่สัญญาตกลงกันว่ากรรมสิทธิ์ในคอมพิวเตอร์ตามสัญญาจะโอนไปยังผู้ซื้อเมื่อผู้ซื้อได้รับมอบคอมพิวเตอร์ดังกล่าวตามข้อ ๕ แล้ว", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๐ การอบรม", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายต้องจัดอบรมวิชาการด้านคอมพิวเตอร์ให้แก่เจ้าหน้าที่ของผู้ซื้อจนสามารถใช้งานคอมพิวเตอร์ได้อย่างมีประสิทธิภาพ โดยต้องดำเนินการฝึกอบรมให้แล้วเสร็จภายใน...................(.....................) วันนับถัดจากวันที่ผู้ซื้อได้รับมอบคอมพิวเตอร์ โดยไม่คิดค่าใช้จ่ายใด ๆ รายละเอียดของการฝึกอบรมให้เป็นไปตามเอกสารแนบท้ายสัญญาผนวก ๕", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ข้อ ๑๑ คู่มือการใช้คอมพิวเตอร์", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายต้องจัดหาและส่งมอบคู่มือการใช้คอมพิวเตอร์ตามสัญญานี้ ตามที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๖ จำนวน…………........(……………………...) ชุด ให้กับผู้ซื้อในวันที่ส่งมอบคอมพิวเตอร์ พร้อมทั้งปรับปรุงให้ทันสมัยเป็นปัจจุบันตลอดอายุสัญญานี้ ทั้งนี้ โดยไม่คิดเงินเพิ่มจากผู้ซื้อ", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๒ การรับประกันความเสียหาย", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่บุคคลภายนอกกล่าวอ้างหรือใช้สิทธิเรียกร้องใด ๆ ว่ามีการละเมิดลิขสิทธิ์หรือสิทธิบัตรหรือสิทธิใด ๆ เกี่ยวกับคอมพิวเตอร์ตามสัญญานี้ โดยผู้ซื้อมิได้แก้ไขดัดแปลงไปจากเดิม ผู้ขายจะต้องดำเนินการทั้งปวงเพื่อให้การกล่าวอ้างหรือการเรียกร้องดังกล่าวระงับสิ้นไปโดยเร็ว หากผู้ซื้อต้องรับผิดชดใช้ค่าเสียหายต่อบุคคลภายนอกเนื่องจากผลแห่งการละเมิดลิขสิทธิ์หรือสิทธิบัตรหรือสิทธิใด ๆ ดังกล่าว ผู้ขายต้องเป็น\r\nผู้ชำระค่าเสียหายและค่าใช้จ่ายรวมทั้งค่าฤชาธรรมเนียมและค่าทนายความแทนผู้ซื้อ ทั้งนี้ ผู้ซื้อจะแจ้งให้ผู้ขายทราบเป็นหนังสือในเมื่อได้มีการกล่าวอ้างหรือใช้สิทธิเรียกร้องดังกล่าวโดยไม่ชักช้า\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๓ การบอกเลิกสัญญา", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อครบกำหนดส่งมอบคอมพิวเตอร์ตามสัญญาแล้ว หากผู้ขายไม่ส่งมอบและติดตั้งคอมพิวเตอร์บางรายการหรือทั้งหมดให้แก่ผู้ซื้อภายในกำหนดเวลาดังกล่าว หรือส่งมอบคอมพิวเตอร์ไม่ตรงตามสัญญาหรือมีคุณสมบัติไม่ถูกต้องตามสัญญา หรือส่งมอบและติดตั้งแล้วเสร็จภายในกำหนดแต่ไม่สามารถใช้งานได้อย่างมีประสิทธิภาพ หรือใช้งานไม่ได้ครบถ้วนตามสัญญา หรือผู้ขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่ง ผู้ซื้อมีสิทธิบอกเลิกสัญญาทั้งหมดหรือแต่บางส่วนได้ การใช้สิทธิบอกเลิกสัญญานั้นไม่กระทบถึงสิทธิของผู้ซื้อที่จะเรียกร้องค่าเสียหายจากผู้ขาย", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ซื้อใช้สิทธิบอกเลิกสัญญา ผู้ซื้อมีสิทธิริบหรือบังคับจากหลักประกัน\r\nตาม (17) (ข้อ ๖ และ) ข้อ ๘ เป็นจำนวนเงินทั้งหมดหรือแต่บางส่วนก็ได้ แล้วแต่ผู้ซื้อจะเห็นสมควร และถ้าผู้ซื้อจัดซื้อคอมพิวเตอร์รวมถึงการติดตั้งจากบุคคลอื่นเต็มจำนวนหรือเฉพาะจำนวนที่ขาดส่ง แล้วแต่กรณี ภายในกำหนด……... (18) .....…(………....……....) เดือน นับถัดจากวันบอกเลิกสัญญา ผู้ขายจะต้องชดใช้ราคาที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานี้ด้วย รวมทั้งค่าใช้จ่ายใด ๆ ที่ผู้ซื้อต้องใช้จ่ายในการจัดหาผู้ขายรายใหม่ดังกล่าวด้วย\r\n\t \tในกรณีที่ผู้ขายได้ส่งมอบคอมพิวเตอร์ให้แก่ผู้ซื้อและผู้ซื้อบอกเลิกสัญญา ผู้ขายจะต้องนำคอมพิวเตอร์กลับคืนไป และทำสถานที่ที่รื้อถอนคอมพิวเตอร์ออกไปให้มีสภาพดังที่มีอยู่เดิมก่อนทำสัญญานี้ภายใน…….…....(……………..….….) วัน นับถัดจากวันที่ผู้ซื้อบอกเลิกสัญญา โดยผู้ขายเป็นผู้เสียค่าใช้จ่ายเองทั้งสิ้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(19) ถ้าผู้ขายไม่ยอมนำคอมพิวเตอร์กลับคืนไปภายในกำหนดเวลาดังกล่าวตามวรรคสาม \r\nผู้ซื้อจะกำหนดเวลาให้ผู้ขายนำคอมพิวเตอร์กลับคืนไปอีกครั้งหนึ่ง หากพ้นกำหนดเวลาดังกล่าวแล้ว ผู้ขายยังไม่นำคอมพิวเตอร์กลับคืนไปอีก ผู้ซื้อมีสิทธินำคอมพิวเตอร์ออกขายทอดตลาด เงินที่ได้จากการขายทอดตลาด ผู้ขายยอมให้ผู้ซื้อหักเป็นค่าปรับและหักเป็นค่าใช้จ่ายและค่าเสียหายที่เกิดแก่ผู้ซื้อ ซึ่งรวมถึงค่าใช้จ่ายต่างๆ ที่ผู้ซื้อ\r\nได้เสียไปในการดำเนินการขายทอดตลาดคอมพิวเตอร์ดังกล่าว ค่าใช้จ่ายในการทำสถานที่ที่รื้อถอนคอมพิวเตอร์ออกไปให้มีสภาพดังที่มีอยู่เดิมก่อนทำสัญญานี้ เงินที่เหลือจากการหักค่าปรับ ค่าใช้จ่าย และค่าเสียหายดังกล่าวแล้วผู้ซื้อจะคืนให้แก่ผู้ขาย \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อผู้ซื้อบอกเลิกสัญญาแล้ว ผู้ซื้อไม่ต้องรับผิดชอบในความเสียหายใด ๆ ทั้งสิ้นอันเกิดแก่คอมพิวเตอร์ซึ่งอยู่ในความครอบครองของผู้ซื้อ ", null, "32"));
     
            
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๔ ค่าปรับ", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ซื้อยังไม่ใช้สิทธิบอกเลิกสัญญาตามข้อ ๑๓ ผู้ขายจะต้องชำระค่าปรับให้ผู้ซื้อ\r\nเป็นรายวัน ในอัตราร้อยละ..….…(20)...…....(…..………..……) ของราคาคอมพิวเตอร์ที่ยังไม่ได้รับมอบ นับถัดจาก\r\nวันครบกำหนดตามสัญญาจนถึงวันที่ผู้ขายได้นำคอมพิวเตอร์มาส่งมอบและติดตั้งให้แก่ผู้ซื้อจนถูกต้องครบถ้วน\r\nตามสัญญา\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การคิดค่าปรับในกรณีที่คอมพิวเตอร์ที่ตกลงซื้อขายเป็นระบบ ถ้าผู้ขายส่งมอบเพียงบางส่วนหรือขาดส่วนประกอบส่วนหนึ่งส่วนใดไป หรือส่งมอบและติดตั้งทั้งหมดแล้วแต่ใช้งานไม่ได้ถูกต้องครบถ้วน \r\nให้ถือว่ายังไม่ได้ส่งมอบคอมพิวเตอร์นั้นเลย และคิดค่าปรับจากราคาคอมพิวเตอร์ทั้งระบบ\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในระหว่างที่ผู้ซื้อยังไม่ได้ใช้สิทธิบอกเลิกสัญญานั้น หากผู้ซื้อเห็นว่าผู้ขายไม่อาจปฏิบัติ\r\nตามสัญญาต่อไปได้ ผู้ซื้อจะใช้สิทธิบอกเลิกสัญญา และริบหรือบังคับจากหลักประกันตาม (21) (ข้อ ๖ และ) ข้อ ๘ กับเรียกร้องให้ชดใช้ราคาที่เพิ่มขึ้นตามที่กำหนดไว้ในข้อ ๑๓ วรรคสอง ก็ได้ และถ้าผู้ซื้อได้แจ้งข้อเรียกร้องให้ชำระค่าปรับไปยังผู้ขายเมื่อครบกำหนดส่งมอบแล้ว ผู้ซื้อมีสิทธิที่จะปรับผู้ขายจนถึงวันบอกเลิกสัญญาได้อีกด้วย\r\n", null, "32"));
           

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๕ \tการบังคับค่าปรับ ค่าเสียหาย และค่าใช้จ่าย", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่งด้วยเหตุใด ๆ ก็ตาม จนเป็นเหตุให้เกิดค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแก่ผู้ซื้อ ผู้ขายต้องชดใช้ค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายดังกล่าวให้แก่ผู้ซื้อ   โดยสิ้นเชิงภายในกำหนด....................(.......................) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ หากผู้ขาย\r\nไม่ชดใช้ให้ถูกต้องครบถ้วนภายในระยะเวลาดังกล่าวให้ผู้ซื้อมีสิทธิที่จะหักเอาจากค่าคอมพิวเตอร์ที่ต้องชำระ    หรือบังคับจากหลักประกันการปฏิบัติตามสัญญาได้ทันที\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หากค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายที่บังคับจากค่าคอมพิวเตอร์ที่ต้องชำระหรือหลักประกันการปฏิบัติตามสัญญาแล้วยังไม่เพียงพอ ผู้ขายยินยอมชำระส่วนที่เหลือที่ยังขาดอยู่จนครบถ้วนตามจำนวนค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายนั้น ภายในกำหนด...............(................) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หากมีเงินค่าคอมพิวเตอร์ที่ซื้อขายตามสัญญาที่หักไว้จ่ายเป็นค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแล้วยังเหลืออยู่อีกเท่าใด ผู้ซื้อจะคืนให้แก่ผู้ขายทั้งหมด", null, "32"));



            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๖ การงดหรือลดค่าปรับ หรือขยายเวลาในการปฏิบัติตามสัญญา", null, "32", true));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่มีเหตุเกิดจากความผิดหรือความบกพร่องของผู้ซื้อ หรือเหตุสุดวิสัย หรือเกิดจากพฤติการณ์อันหนึ่งอันใดที่ผู้ขายไม่ต้องรับผิดตามกฎหมาย" +
                "หรือเหตุอื่นตามที่กำหนดในกฎกระทรวง ซึ่งออกตามความในกฎหมายว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ ทำให้ผู้ขายไม่สามารถส่งมอบและติดตั้งคอมพิวเตอร์ " +
                "หรือบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์ ตามเงื่อนไขและกำหนดเวลาแห่งสัญญานี้ได้ ผู้ขายมีสิทธิของดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญา โดยจะต้องแจ้งเหตุหรือพฤติการณ์ดังกล่าวพร้อมหลักฐาน\r\n" +
                "เป็นหนังสือให้ผู้ซื้อทราบภายใน ๑๕ (สิบห้า) วัน นับถัดจากวันที่เหตุนั้นสิ้นสุดลง หรือตามที่กำหนดในกฎกระทรวงดังกล่าว \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายไม่ปฏิบัติให้เป็นไปตามความในวรรคหนึ่ง ให้ถือว่าผู้ขายได้สละสิทธิเรียกร้อง\r\nในการที่จะของดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญา โดยไม่มีเงื่อนไขใด ๆ ทั้งสิ้น เว้นแต่กรณี\r\nเหตุเกิดจากความผิดหรือความบกพร่องของฝ่ายผู้ซื้อซึ่งมีหลักฐานชัดแจ้งหรือผู้ซื้อทราบดีอยู่แล้วตั้งแต่ต้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การงดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญาตามวรรคหนึ่ง อยู่ในดุลพินิจของ    ผู้ซื้อที่จะพิจารณาตามที่เห็นสมควร", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๗ การใช้เรือไทย", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายจะต้องสั่งหรือนำเข้าคอมพิวเตอร์มาจากต่างประเทศและต้องนำเข้ามาโดยทางเรือ\r\nในเส้นทางเดินเรือที่มีเรือไทยเดินอยู่ และสามารถให้บริการรับขนได้ตามที่รัฐมนตรีว่าการกระทรวงคมนาคมประกาศกำหนด ผู้ขายต้องจัดการให้คอมพิวเตอร์บรรทุกโดยเรือไทยหรือเรือที่มีสิทธิเช่นเดียวกับเรือไทย\r\nจากต่างประเทศมายังประเทศไทย เว้นแต่จะได้รับอนุญาตจากกรมเจ้าท่าก่อนบรรทุกคอมพิวเตอร์ลงเรืออื่น\r\nที่มิใช่เรือไทยหรือเป็นของที่รัฐมนตรีว่าการกระทรวงคมนาคมประกาศยกเว้นให้บรรทุกโดยเรืออื่นได้ \r\nทั้งนี้ ไม่ว่าการสั่งหรือนำเข้าคอมพิวเตอร์จากต่างประเทศจะเป็นแบบใด\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในการส่งมอบคอมพิวเตอร์ให้แก่ผู้ซื้อ ถ้าเป็นกรณีตามวรรคหนึ่งผู้ขายจะต้องส่งมอบใบตราส่ง (Bill of Lading) หรือสำเนาใบตราส่งสำหรับคอมพิวเตอร์นั้น ซึ่งแสดงว่าได้บรรทุกมาโดยเรือไทย หรือเรือที่มีสิทธิเช่นเดียวกับเรือไทยให้แก่ผู้ซื้อพร้อมกับการส่งมอบคอมพิวเตอร์ด้วย", null, "32"));
         

            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่คอมพิวเตอร์ไม่ได้บรรทุกจากต่างประเทศมายังประเทศไทยโดยเรือไทยหรือ\r\nเรือที่มีสิทธิเช่นเดียวกับเรือไทย ผู้ขายต้องส่งมอบหลักฐานซึ่งแสดงว่าได้รับอนุญาตจากกรมเจ้าท่าให้บรรทุกของโดยเรืออื่นได้ หรือหลักฐานซึ่งแสดงว่าได้ชำระค่าธรรมเนียมพิเศษเนื่องจากการไม่บรรทุกของโดยเรือไทย\r\nตามกฎหมายว่าด้วยการส่งเสริมการพาณิชยนาวีแล้วอย่างใดอย่างหนึ่งแก่ผู้ซื้อด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ขายไม่ส่งมอบหลักฐานอย่างใดอย่างหนึ่งดังกล่าวในวรรคสองและวรรคสามให้แก่ผู้ซื้อแต่จะขอส่งมอบคอมพิวเตอร์ให้ผู้ซื้อก่อนโดยยังไม่รับชำระเงินค่าคอมพิวเตอร์ ผู้ซื้อมีสิทธิรับคอมพิวเตอร์ไว้ก่อนและชำระเงินค่าคอมพิวเตอร์เมื่อผู้ขายได้ปฏิบัติถูกต้องครบถ้วนดังกล่าวแล้วได้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("สัญญานี้ทำขึ้นสองฉบับ มีข้อความถูกต้องตรงกัน คู่สัญญาได้อ่านและเข้าใจข้อความโดยละเอียดตลอดแล้ว จึงได้ลงลายมือชื่อพร้อมทั้งประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยานและคู่สัญญาต่างยึดถือไว้\r\nฝ่ายละหนึ่งฉบับ\r\n", null, "32"));



            body.AppendChild(WordServiceSetting.EmptyParagraph());

            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ........................................................................ผู้ซื้อ"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(................................................................................)"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ........................................................................ผู้ขาย"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(................................................................................)"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ......................................................................พยาน"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(...............................................................................)"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ......................................................................พยาน"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(...............................................................................)"));

            // next page
            body.AppendChild(new Paragraph(new Run(new Break() { Type = BreakValues.Page })));
            body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("วิธีปฏิบัติเกี่ยวกับสัญญาซื้อขายคอมพิวเตอร์", "000000", "36"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(1) ให้ระบุเลขที่สัญญาในปีงบประมาณหนึ่งๆ ตามลำดับ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(2) \tให้ระบุชื่อของหน่วยงานของรัฐที่เป็นนิติบุคคล เช่น กรม ก. หรือรัฐวิสาหกิจ ข. เป็นต้น", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(3) \tให้ระบุชื่อและตำแหน่งของหัวหน้าหน่วยงานของรัฐที่เป็นนิติบุคคลนั้น หรือผู้ที่ได้รับ\r\nมอบอำนาจ เช่น นาย ก. อธิบดีกรม………...… หรือ นาย ข. ผู้ได้รับมอบอำนาจจากอธิบดีกรม………......………..\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(4) \tให้ระบุชื่อผู้รับจ้าง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ก. กรณีนิติบุคคล เช่น ห้างหุ้นส่วนสามัญจดทะเบียน ห้างหุ้นส่วนจำกัด บริษัทจำกัด", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ข. กรณีบุคคลธรรมดา ให้ระบุชื่อและที่อยู่", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(5) \tเป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(6) \tเป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๗) ให้ระบุยี่ห้อคอมพิวเตอร์ รุ่นคอมพิวเตอร์", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๘) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้\r\nตามข้อเท็จจริง\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(9) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้\r\nตามข้อเท็จจริง\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(10) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้\r\nตามข้อเท็จจริง\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(11) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้\r\nตามข้อเท็จจริง\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(12) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะของสิ่งของ\r\nที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(13) ให้กำหนดในอัตราระหว่างร้อยละ ๐.๐๒๕ – ๐.๐๓๕ ของราคาตามสัญญาต่อชั่วโมง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(14) “หลักประกัน” หมายถึง หลักประกันที่ผู้รับจ้างนำมามอบไว้แก่หน่วยงานของรัฐเมื่อลงนามในสัญญาเพื่อประกันความเสียหายที่อาจเกิดขึ้นจากการปฏิบัติตามสัญญา ดังนี้ ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑)\tเงินสด ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๒)\tเช็คหรือดราฟท์ที่ธนาคารเซ็นสั่งจ่าย ซึ่งเป็นเช็คหรือดราฟท์ลงวันที่ที่ใช้เช็คหรือดราฟท์นั้นชำระต่อเจ้าหน้าที่ หรือก่อนวันนั้นไม่เกิน ๓ วันทำการ ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๓)\tหนังสือค้ำประกันของธนาคารภายในประเทศตามตัวอย่างที่คณะกรรมการนโยบายกำหนด \r\nโดยอาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๔)\tหนังสือค้ำประกันของบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาต\r\nให้ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบ โดยอนุโลมให้ใช้ตามตัวอย่างหนังสือ         ค้ำประกันของธนาคารที่คณะกรรมการนโยบายกำหนด\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๕)\tพันธบัตรรัฐบาลไทย", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(15) ให้กำหนดจำนวนเงินหลักประกันการปฏิบัติตามสัญญาตามระเบียบกระทรวงการคลังว่าด้วย\r\nการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๘ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(16) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้\r\nตามข้อเท็จจริง\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(17) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้\r\nตามข้อเท็จจริง\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(18) กำหนดเวลาที่ผู้ซื้อจะซื้อสิ่งของจากแหล่งอื่นเมื่อบอกเลิกสัญญาและมีสิทธิเรียกเงินในส่วนที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานั้น ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(19) ความในวรรคนี้อาจแก้ไขเปลี่ยนแปลงได้ตามความเหมาะสมถ้าหน่วยงานของรัฐผู้ทำสัญญาสามารถกำหนดมาตรการอื่นใดในสัญญา หรือกำหนดทางปฏิบัติเพื่อแก้ปัญหาที่ผู้ขายไม่ยอมนำคอมพิวเตอร์กลับคืนไปได้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("20) อัตราค่าปรับตามสัญญาข้อ ๑๔ ให้กำหนดเป็นรายวันในอัตราตายตัวระหว่างร้อยละ \r\n๐.๐๑ – ๐.๒๐ ของราคาพัสดุที่ยังไม่ได้ส่งมอบ ตามระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้างและ\r\nการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๒ ส่วนกรณีจะปรับร้อยละเท่าใด ให้อยู่ในดุลพินิจของหน่วยงานของรัฐ\r\nผู้ซื้อที่จะพิจารณา โดยคำนึงถึงราคาและลักษณะของพัสดุที่ซื้อ ซึ่งอาจมีผลกระทบต่อการที่ผู้ขายจะหลีกเลี่ยง\r\nไม่ปฏิบัติตามสัญญา แต่ทั้งนี้ การที่จะกำหนดค่าปรับเป็นร้อยละเท่าใดจะต้องกำหนดไว้ในเอกสารเชิญชวนด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(21) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้\r\nตามข้อเท็จจริง\r\n", null, "32"));
           
            body.AppendChild(WordServiceSetting.EmptyParagraph());




            WordServiceSetting.AddHeaderWithPageNumber(mainPart, body);

        }
        stream.Position = 0;
        return stream.ToArray();
    }
#endregion 4.1.1.2.11.สัญญาเช่าคอมพิวเตอร์ ร.309-60

}
