using BatchAndReport.DAO;
using BatchAndReport.Entities;
using BatchAndReport.Models;
using BatchAndReport.Services;
using DocumentFormat.OpenXml;
using DocumentFormat.OpenXml.Packaging;
using DocumentFormat.OpenXml.Wordprocessing;
using Microsoft.AspNetCore.Mvc;


public class WordEContract_BuyAgreeProgram
{
    private readonly WordServiceSetting _w;

    public WordEContract_BuyAgreeProgram(WordServiceSetting ws)
    {
        _w = ws;
    }
    #region 4.1.1.2.10.สัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ ร.308-60
    public byte[] OnGetWordContact_BuyAgreeProgram()
    {

        var stream = new MemoryStream();

        using (var wordDoc = WordprocessingDocument.Create(stream, DocumentFormat.OpenXml.WordprocessingDocumentType.Document, true))
        {
            var mainPart = wordDoc.AddMainDocumentPart();
            mainPart.Document = new DocumentFormat.OpenXml.Wordprocessing.Document();

            // Styles
            var stylePart = mainPart.AddNewPart<StyleDefinitionsPart>();
            stylePart.Styles = WordServiceSetting.CreateDefaultStyles();

            var body = mainPart.Document.AppendChild(new Body());

            body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("แบบสัญญา", "000000", "36"));
            body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("สัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์", "000000", "36"));
            // 2. Document title and subtitle
            body.AppendChild(WordServiceSetting.EmptyParagraph());
            body.AppendChild(WordServiceSetting.RightParagraph("สัญญาเลขที่………….…… (1)...........……..……..."));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("สัญญาฉบับนี้ทำขึ้น ณ ………….……..…………………………………………………………………………......."));
            body.AppendChild(WordServiceSetting.JustifiedParagraph("ตำบล/แขวง…………………..………………….………………. อำเภอ/เขต……………………….….……………………………...\r\n" +
            "จังหวัด…….…………………………….………….เมื่อวันที่ ……….……… เดือน …………………….. พ.ศ. ……....……… \r\n" +
            "ระหว่าง……………………………………………………………… (2) ………………………………………………………………………..\r\n" +
            "โดย………...…………….…………………………….……………(3) ………..…………………………………………..…………………\r\n" +
            "ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ซื้อ” ฝ่ายหนึ่ง กับ…………….…………..…… (4 ก) …………..…………………….\r\n" +
            "ซึ่งจดทะเบียนเป็นนิติบุคคล ณ ……………………………………………………………………………………….………….……..มี\r\n" +
            "สำนักงานใหญ่อยู่เลขที่ ……………......……ถนน……………….……………..ตำบล/แขวง…….……….…..……….…....\r\n" +
            "อำเภอ/เขต………………….…..…….จังหวัด………..…………………..….โดย………….…………………………………..……...\r\n" +
            "มีอำนาจลงนามผูกพันนิติบุคคลปรากฏตามหนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท ……………\r\n" +
            "ลงวันที่………………………………..… (5)(และหนังสือมอบอำนาจลงวันที่ ……………….……..) แนบท้ายสัญญานี้\r\n" +
            "(6)(ในกรณีที่ผู้รับจ้างเป็นบุคคลธรรมดาให้ใช้ข้อความว่า กับ …………………..….… (4 ข) …………………….............\r\n" +
            "อยู่บ้านเลขที่ …………….….…..….ถนน…………………..……..…...……ตำบล/แขวง ……..………………….….…………\r\n" +
            "อำเภอ/เขต…………………….………….…..จังหวัด…………...…..………….……...……. ผู้ถือบัตรประจำตัวประชาชน\r\n" +
            "เลขที่................................ ดังปรากฏตามสำเนาบัตรประจำตัวประชาชนแนบท้ายสัญญานี้) ซึ่งต่อไปใน\r\n" +
            "สัญญานี้เรียกว่า “ผู้ขาย” อีกฝ่ายหนึ่ง", "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ 1 ข้อตกลงเช่า", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("“โปรแกรมคอมพิวเตอร์” หมายความว่า คำสั่ง ชุดคำสั่งหรือสิ่งอื่นใดที่นำไปใช้กับ\r\nเครื่องคอมพิวเตอร์ เพื่อให้เครื่องคอมพิวเตอร์ทำงานหรือเพื่อให้ได้รับผลอย่างหนึ่งอย่างใด ทั้งนี้ ไม่ว่าจะเป็นภาษาโปรแกรมคอมพิวเตอร์ในลักษณะใดที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("“สื่อ” หมายความว่า วัตถุซึ่งมีโปรแกรมคอมพิวเตอร์บันทึกอยู่", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๒\tข้อตกลงซื้อขายและอนุญาตให้ใช้สิทธิ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ซื้อตกลงซื้อ และผู้ขายตกลงขาย และอนุญาตให้ใช้สิทธิโปรแกรมคอมพิวเตอร์ \r\nพร้อมด้วยสื่อและคู่มือการใช้โปรแกรมคอมพิวเตอร์ เป็นราคารวมทั้งสิ้น….……..…...บาท (…………..…………..) \r\nซึ่งเป็นราคาที่ได้รวมภาษีมูลค่าเพิ่มจำนวน….………………..บาท (…………..…………..) ตลอดจนภาษีอากรอื่น ๆ \r\nและค่าใช้จ่ายทั้งปวงด้วยแล้ว รายละเอียดโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิเป็นไปตามเอกสารแนบท้ายสัญญาผนวก ๑\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๓\tการรับรองและการอนุญาตให้ใช้สิทธิ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๑ ผู้ขายรับรองและยืนยันว่าผู้ขายเป็นเจ้าของลิขสิทธิ์ รวมถึงสิทธิในทรัพย์สิน\r\nทางปัญญาอื่นใด และมีสิทธิแต่ผู้เดียวอย่างสมบูรณ์โดยปราศจากภาระผูกพันใดๆ อันจะทำให้เสื่อมสิทธิ\r\nในโปรแกรมคอมพิวเตอร์หรือคู่มือการใช้หรือสิ่งอื่นใดที่เกี่ยวข้องกับโปรแกรมคอมพิวเตอร์ และ/หรือผู้ขายรับรองและยืนยันว่ามีอำนาจในการอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ คู่มือการใช้หรือสิ่งอื่นใดที่เกี่ยวข้องกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้โดยชอบด้วยกฎหมาย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๒ ผู้ขายตกลงอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ในหลายลักษณะ\r\nหรือลักษณะใดลักษณะหนึ่งเพียงลักษณะเดียวดังนี้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์หนึ่งชุดกับเครื่องคอมพิวเตอร์เครื่องใดเครื่องหนึ่ง \r\n(Single License) โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ในขณะเดียวกันไม่เกิน….……..(…….…...) คน\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ที่บรรจุโปรแกรมคอมพิวเตอร์ จำนวน….……………....(………..…………..) เครื่อง (Volume License) โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ที่บรรจุในเครื่องคอมพิวเตอร์แต่ละเครื่องในขณะเดียวกันไม่เกิน….……..…...(…………..……..) คน", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์หลักในระบบเครือข่าย\r\nเพื่อทำให้เครื่องคอมพิวเตอร์ จำนวน….……..…...(…………..…………..) เครื่อง สามารถใช้โปรแกรมคอมพิวเตอร์ได้ ในขณะเดียวกัน (Network License)\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ของผู้ซื้อได้ โดยไม่จำกัดจำนวน ในขณะเดียวกัน (Corporate License)", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๗) ๓.๓ กำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ \r\nเริ่มต้นตั้งแต่วันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วน และสิ้นสุดวันที่………….………..…………..\r\nรวมเป็นเวลา….…….......(…………..……..) ปี ….………....(………………..) เดือน ….………...(…..…………..) วัน\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๓.๔ ในกรณีที่ผู้ขายเป็นผู้มีอำนาจอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์\r\nตามสัญญานี้ ผู้ขายได้นำเอกสารหลักฐานเกี่ยวกับการเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ดังกล่าว ซึ่งออกโดยเจ้าของลิขสิทธิ์ มามอบให้แก่ผู้ซื้อในขณะลงนามในสัญญานี้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เอกสารหลักฐานที่แสดงว่าผู้ขายเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ ซึ่งผู้ขายจะต้องนำมามอบให้แก่ผู้ซื้อตามวรรคหนึ่ง จะต้องมีข้อความที่แสดงให้เห็นว่า \r\nในกรณีที่ผู้ขายเลิกกิจการหรือถูกเพิกถอนการอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้\r\nจากเจ้าของลิขสิทธิ์ เจ้าของลิขสิทธิ์จะยอมผูกพันตามสัญญานี้แทนผู้ขายหรือจัดให้ผู้มีอำนาจอนุญาต       ให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์รายอื่นผูกพันตามสัญญานี้แทนผู้ขาย และอนุญาตให้ผู้ซื้อใช้สิทธิ\r\nในโปรแกรมคอมพิวเตอร์ โดยผู้ซื้อไม่ต้องเสียค่าใช้จ่ายใดๆ ทั้งสิ้น\r\n", null, "32"));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๔\tเอกสารอันเป็นส่วนหนึ่งของสัญญา", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เอกสารแนบท้ายสัญญาดังต่อไปนี้ ให้ถือเป็นส่วนหนึ่งของสัญญานี้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๑ \tผนวก ๑ …(รายละเอียดและราคาโปรแกรมคอมพิวเตอร์ที่ซื้อขาย", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs(" และการอนุญาตให้ใช้สิทธิพร้อมสื่อและคู่มือ)... \tจำนวน......(......) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๒ \tผนวก ๒ ...(รายการคุณลักษณะเฉพาะ)...\t\t\tจำนวน......(......) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๓ \tผนวก ๓ … (รายละเอียดการทดสอบการใช้งานโปรแกรม\r\n\t\t\tคอมพิวเตอร์)...\t\tจำนวน......(......) หน้า\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๔ \tผนวก ๔ ...(การอบรมการใช้งานโปรแกรมคอมพิวเตอร์)...\r\n\t\t\tจำนวน......(......) หน้า\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๕ \tผนวก ๕ …(รายละเอียดการให้บริการหลังการขาย)...\tจำนวน......(......) หน้า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๔.๖ \tผนวก ๖ …(รายละเอียดการแก้ไขพัฒนาโปรแกรม\r\n\t\t\t\tคอมพิวเตอร์ให้ดีขึ้น)...\t\tจำนวน......(......) หน้า\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ความใดในเอกสารแนบท้ายสัญญาที่ขัดหรือแย้งกับข้อความในสัญญานี้ ให้ใช้ข้อความ\r\nในสัญญานี้บังคับ และในกรณีที่เอกสารแนบท้ายสัญญาขัดแย้งกันเอง ผู้ขายจะต้องปฏิบัติตามคำวินิจฉัยของผู้ซื้อ คำวินิจฉัยของผู้ซื้อให้ถือเป็นที่สุด และผู้ขายไม่มีสิทธิเรียกร้องราคา ค่าเสียหาย หรือค่าใช้จ่ายใดๆ เพิ่มเติมจากผู้ซื้อทั้งสิ้น\r\n", null, "32"));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๕\tการส่งมอบ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายจะต้องส่งมอบและติดตั้งโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้ให้มีคุณสมบัติถูกต้องและครบถ้วนตามที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ โดยให้พร้อมใช้งานได้ตามรายละเอียดการทดสอบที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๓ ให้แก่ผู้ซื้อ ณ ........................................................ ภายใน…….…(๘)……....(…………..…………..) วัน นับถัดจากวันลงนามในสัญญา", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีผู้ขายประสงค์จะนำโปรแกรมคอมพิวเตอร์รายการใดที่ต่างไปจากรายละเอียด ที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ มาส่งมอบและติดตั้งให้ผู้ซื้อ ผู้ขายต้องได้รับความยินยอมเป็นหนังสือจากผู้ซื้อก่อน และโปรแกรมคอมพิวเตอร์ที่จะนำมาส่งมอบดังกล่าวนั้นจะต้องมีคุณสมบัติไม่ต่ำกว่าที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การส่งมอบโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ไม่ว่าจะเป็นการส่งมอบเพียงครั้งเดียว \r\nหรือส่งมอบหลายครั้ง ผู้ขายจะต้องแจ้งกำหนดเวลาส่งมอบแต่ละครั้งโดยทำเป็นหนังสือยื่นต่อผู้ซื้อ \r\nณ .................................... ในวันและเวลาทำการของผู้ซื้อ ก่อนวันส่งมอบไม่น้อยกว่า.........(๙)..........(........................) วันทำการของผู้ซื้อ\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๖\tการตรวจรับ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อผู้ซื้อได้ตรวจรับโปรแกรมคอมพิวเตอร์ที่ส่งมอบและเห็นว่าถูกต้องครบถ้วน         ตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ แนบท้ายสัญญานี้และเงื่อนไขต่างๆ ของสัญญานี้แล้ว ผู้ซื้อจะออกหนังสือแสดงการรับมอบโปรแกรมคอมพิวเตอร์เพื่อผู้ขายใช้เป็นหลักฐานประกอบการขอรับชำระราคาค่าโปรแกรมคอมพิวเตอร์", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผลการตรวจรับปรากฏว่า โปรแกรมคอมพิวเตอร์ที่ผู้ขายส่งมอบไม่ถูกต้องครบถ้วน\r\nหรือไม่ตรงตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์แนบท้ายสัญญานี้ และเงื่อนไขต่างๆ ของสัญญานี้ หรือใช้งานได้ไม่ถูกต้องครบถ้วนตามข้อ ๕ ผู้ซื้อทรงไว้ซึ่งสิทธิที่จะไม่รับโปรแกรมคอมพิวเตอร์นั้น ในกรณีเช่นว่านี้ ผู้ขายต้องนำโปรแกรมคอมพิวเตอร์นั้นกลับคืนโดยเร็วที่สุดเท่าที่จะทำได้และนำโปรแกรมคอมพิวเตอร์ใหม่มาส่งมอบให้แก่ผู้ซื้อ หรือต้องทำการแก้ไขให้ถูกต้องตามสัญญาด้วยค่าใช้จ่ายของผู้ขายเอง และระยะเวลาที่เสียไปเพราะเหตุดังกล่าว ผู้ขายจะนำมาอ้างเป็นเหตุขอขยายเวลาตามสัญญาหรือของดหรือลดค่าปรับไม่ได้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑๐) ในกรณีที่ผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ไม่ครบถ้วนหรือส่งมอบครบถ้วน \r\nแต่ใช้งานได้ไม่ถูกต้องตามที่กำหนดไว้ในข้อ ๕ แต่ไม่ถึงกับทำให้ระบบคอมพิวเตอร์ทั้งหมดใช้การไม่ได้      ผู้ซื้อจะตรวจรับโปรแกรมคอมพิวเตอร์เฉพาะส่วนที่ใช้งานได้ถูกต้องครบถ้วน โดยออกหนังสือแสดงการรับมอบโปรแกรมคอมพิวเตอร์เฉพาะส่วนนั้นก็ได้ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การตรวจรับจะสมบูรณ์ตามสัญญานี้ก็ต่อเมื่อผู้ซื้อได้ทดสอบโปรแกรมคอมพิวเตอร์        ว่าสามารถปฏิบัติงานได้เต็มความประสงค์ของผู้ซื้ออย่างถูกต้องครบถ้วน", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๗\tการชำระเงิน ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑๑) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย เมื่อผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วนตามข้อ ๖ และผู้ขายได้อบรมเจ้าหน้าที่ของผู้ซื้อตามข้อ ๑๑ เสร็จสิ้นแล้ว ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑๒) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย เป็นงวดๆ รวม….………...(……………..) งวด ดังนี้ ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("งวดที่หนึ่งเป็นเงิน….…………...บาท (…………..……..………..) จะจ่ายให้เมื่อผู้ซื้อได้ใช้โปรแกรมคอมพิวเตอร์เป็นเวลา….………...(…………..…………..) เดือน", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("งวดที่สองเป็นเงิน….…………...บาท (…………..………..……..) จะจ่ายให้เมื่อผู้ซื้อได้ใช้โปรแกรมคอมพิวเตอร์เป็นเวลา….………...(…………..…………..) เดือน", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("...........................................ฯลฯ..............................................", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("งวดสุดท้ายเป็นเงิน….……..…...บาท (…………..…………..) จะจ่ายให้เมื่อครบกำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ดังกล่าว", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในระหว่างงวดหนึ่งงวดใด หากผู้ขายเลิกกิจการ หรือถูกเพิกถอนการเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ผู้ซื้อจะชำระเงินค่าโปรแกรมคอมพิวเตอร์\r\nที่ถึงกำหนดชำระในวันหรือหลังจากวันที่ผู้ซื้อได้ทราบถึงเหตุดังกล่าวให้แก่เจ้าของลิขสิทธิ์รายใหม่ \r\nหรือผู้มีอำนาจอนุญาตให้ผู้อื่นใช้สิทธิในโปรแกรมคอมพิวเตอร์รายอื่นซึ่งเจ้าของลิขสิทธิ์จัดให้มาผูกพัน\r\nตามสัญญานี้ แล้วแต่กรณีแทน \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การจ่ายเงินตามเงื่อนไขแห่งสัญญานี้ ผู้ซื้อจะโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขาย ชื่อธนาคาร............................................................สาขา........................................................................ชื่อบัญชี...........................................เลขที่บัญชี...............................................ทั้งนี้ผู้ขายตกลงเป็นผู้รับภาระเงินค่าธรรมเนียม หรือค่าบริการอื่นใดเกี่ยวกับการโอน รวมทั้งค่าใช้จ่ายอื่นใด (ถ้ามี) ที่ธนาคารเรียกเก็บและยินยอมให้มีการหักเงินดังกล่าวจากจำนวนเงินโอนในงวดนั้นๆ (ความในวรรคนี้ใช้สำหรับกรณีที่หน่วยงานของรัฐจะจ่ายเงินตรงแก่ผู้ขาย (ระบบ Direct Payment) โดยการโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขายตามแนวทางที่กระทรวงการคลังหรือหน่วยงานของรัฐเจ้าของงบประมาณเป็นผู้กำหนดแล้วแต่กรณี)", null, "32"));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๘\tสิทธิของผู้ซื้อ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๑ \tผู้ซื้อมีสิทธิที่จะใช้โปรแกรมคอมพิวเตอร์และคู่มือสำหรับผู้ใช้โปรแกรมคอมพิวเตอร์ตามสัญญานี้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๒ ผู้ซื้อขอรับรองว่าจะไม่ลบ ทำลาย ทำให้เสียหาย หรือทำให้ไม่ชัดเจนซึ่งเครื่องหมายหรือสัญลักษณ์แสดงความเป็นเจ้าของลิขสิทธิ์หรือเครื่องหมายการค้าของผู้ขายโดยจงใจหรือประมาทเลินเล่ออย่างร้ายแรง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๓ ผู้ซื้อมีสิทธิทำสำเนาโปรแกรมคอมพิวเตอร์ได้.………….......(………..…………..) ชุด \r\nเพื่อป้องกันการสูญหายในการใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ตามข้อ ๘.๔ ข. และอาจทำสำเนามากกว่านั้น หากได้รับความยินยอมเป็นหนังสือจากผู้ขาย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๔ ก. ผู้ซื้อมีสิทธิโอนโปรแกรมคอมพิวเตอร์ตามสัญญานี้ พร้อมด้วยสิทธิและหน้าที่\r\nตามสัญญาฉบับนี้ สำเนาทุกชุดของโปรแกรมคอมพิวเตอร์ และคู่มือการใช้ทั้งหมดให้ผู้รับโอน โดยที่ผู้รับโอนจะต้องตกลงผูกพันตามข้อตกลงในสัญญานี้ทุกประการ\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ข. สัญญาฉบับนี้อนุญาตให้ผู้ซื้อบรรจุโปรแกรมคอมพิวเตอร์ลงในเครื่องคอมพิวเตอร์ หมายเลข............................................ของ............................................ที่อยู่เลขที่...........................................\r\nถนน.......................................ตำบล/แขวง..........................................อำเภอ/เขต...........................................\r\nจังหวัด............................................ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ขายยินยอมให้มีการเคลื่อนย้ายโปรแกรมคอมพิวเตอร์จากเครื่องคอมพิวเตอร์ตามวรรคหนึ่ง ผู้ขายจะไม่เรียกร้องให้ผู้ซื้อชำระค่าโปรแกรมคอมพิวเตอร์เพิ่มเติมจากที่ได้ตกลงกัน\r\nตามสัญญานี้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๘.๕ ผู้ขายจะไม่โอนลิขสิทธิ์ใดๆ ในโปรแกรมคอมพิวเตอร์ หรือสิทธิการเป็นผู้มีอำนาจอนุญาตให้ผู้อื่นใช้สิทธิในโปรแกรมคอมพิวเตอร์ของตนทั้งหมดหรือแต่บางส่วนตามสัญญานี้ให้แก่บุคคลอื่น", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๙ (ก) การรับประกันความชำรุดบกพร่อง", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๑ ผู้ขายรับรองว่านับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรมคอมพิวเตอร์จะทำงานได้ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วนสมบูรณ์ทุกประการ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๒ ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆ ที่เกิดขึ้นแก่เครื่องคอมพิวเตอร์และอุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใดอันเกิดจาก ความชำรุดบกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด เป็นเวลา...(13)...(……………..) ปี ….……...(………..) เดือน นับถัดจากวันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์โดยถูกต้องครบถ้วนตามสัญญา", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์\r\nเกิดการชำรุดบกพร่อง หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรมคอมพิวเตอร์ดังกล่าวให้ทำงานได้อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์\r\nอันใหม่ที่ได้มาตรฐานและมีคุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า ทั้งนี้ ไม่เกิน…...…(14).….…...(……….……..…………..) วัน นับถัดจากวันที่ได้รับแจ้ง\r\nเป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้งสิ้นแทนผู้ซื้อ", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๙ (ข)\t การรับประกันความชำรุดบกพร่อง", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๑ ภายในกำหนดระยะเวลาการอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามข้อ ๓.๓ ผู้ขายรับประกันว่านับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรมคอมพิวเตอร์จะทำงานได้ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วนสมบูรณ์ทุกประการ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๙.๒ ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆ ที่เกิดขึ้นแก่เครื่องคอมพิวเตอร์และอุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใด อันเกิดจาก\r\nความชำรุดบกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด ภายในกำหนดระยะเวลาอนุญาต\r\nให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามข้อ ๓.๓ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์\r\nเกิดการชำรุดบกพร่อง หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรมคอมพิวเตอร์ดังกล่าวให้ทำงานได้อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์\r\nอันใหม่ที่ได้มาตรฐานและมีคุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า ทั้งนี้ ไม่เกิน..…..…(15)………..(……..…..…………..) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้งสิ้นแทนผู้ซื้อ", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๐\tหลักประกันการปฏิบัติตามสัญญา ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในขณะทำสัญญานี้ ผู้ขายได้นำหลักประกันเป็น………….…….(16)….....................\r\nเป็นจำนวนเงิน…………..บาท (……………………..) ซึ่งเท่ากับร้อยละ.…..(17)..….(…………….……) ของราคา\r\nค่าโปรแกรมคอมพิวเตอร์ มามอบไว้แก่ผู้ซื้อเพื่อเป็นหลักประกันการปฏิบัติตามสัญญานี้ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(18) กรณีผู้ขายใช้หนังสือค้ำประกันมาเป็นหลักประกันการปฏิบัติตามสัญญา หนังสือค้ำประกันดังกล่าวจะต้องออกโดยธนาคารที่ประกอบกิจการในประเทศไทย หรือโดยบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจ\r\nค้ำประกันตามประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบตามแบบที่คณะกรรมการนโยบายการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐกำหนด หรืออาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้ และจะต้องมีอายุ\r\nการค้ำประกันตลอดไปจนกว่าผู้ขายพ้นข้อผูกพันตามสัญญานี้ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หลักประกันที่ผู้ขายนำมามอบให้ตามวรรคหนึ่ง จะต้องมีอายุครอบคลุมความรับผิดทั้งปวงของผู้ขายตลอดอายุสัญญา ถ้าหลักประกันที่ผู้ขายนำมามอบให้ดังกล่าวลดลงหรือเสื่อมค่าลง           หรือมีอายุไม่ครอบคลุมถึงความรับผิดของผู้ขายตลอดอายุสัญญา ไม่ว่าด้วยเหตุใดๆ ก็ตาม รวมถึงกรณีผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ล่าช้าเป็นเหตุให้ระยะเวลาแล้วเสร็จหรือวันครบกำหนดความรับผิด      ในความชำรุดบกพร่อง (ถ้ามี) ตามสัญญาเปลี่ยนแปลงไป ผู้ขายต้องหาหลักประกันใหม่หรือหลักประกันเพิ่มเติมให้มีจำนวนครบถ้วนตามวรรคหนึ่งมามอบให้แก่ผู้ซื้อภายใน….………...(……….………..) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หลักประกันที่ผู้ขายนำมามอบไว้ตามข้อนี้ ผู้ซื้อจะคืนให้แก่ผู้ขายโดยไม่มีดอกเบี้ย \r\nเมื่อผู้ขายพ้นจากข้อผูกพันและความรับผิดทั้งปวงตามสัญญานี้แล้ว\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๑\tการอบรม", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายต้องจัดอบรมการใช้งานโปรแกรมคอมพิวเตอร์ตามสัญญานี้ให้แก่เจ้าหน้าที่\r\nของผู้ซื้อให้เข้าใจและสามารถใช้งานโปรแกรมคอมพิวเตอร์ได้เป็นอย่างดี มีประสิทธิภาพ โดยจะต้องส่งหลักสูตรตารางฝึกอบรมและสถานที่ฝึกอบรมให้ผู้ซื้อหรือผู้บริหารจัดการดูแลโปรแกรมคอมพิวเตอร์ที่ผู้ซื้อแต่งตั้งพิจารณาเห็นชอบเป็นหนังสือก่อนดำเนินการฝึกอบรมโดยต้องดำเนินการฝึกอบรมให้แล้วเสร็จภายใน…...............(…….…………..) วัน นับถัดจากวันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โดยไม่คิดค่าใช้จ่ายในการจัดอบรมจากผู้ซื้อ รายละเอียดของการอบรมให้เป็นไปตามเอกสารแนบท้ายสัญญาผนวก ๔ \r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๒\tคู่มือการใช้โปรแกรมคอมพิวเตอร์และการให้คำแนะนำ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๒.๑ ผู้ขายต้องจัดหาคู่มือการใช้โปรแกรมคอมพิวเตอร์ซึ่งเป็นต้นฉบับ จำนวน ......……....(…….………..) ชุด ให้เป็นกรรมสิทธิ์ของผู้ซื้อตามรายละเอียดที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก ๑ พร้อมทั้งจะต้องปรับปรุงคู่มือดังกล่าวให้ทันสมัยทุกครั้งที่มีการปรับปรุงโปรแกรมคอมพิวเตอร์ให้ทันสมัยขึ้นตลอดระยะเวลารับประกันตามข้อ ๙.๒ และต้องให้คำแนะนำในการใช้โปรแกรมคอมพิวเตอร์และคู่มือการใช้โปรแกรมคอมพิวเตอร์เมื่อมีการปรับปรุงโปรแกรมคอมพิวเตอร์ดังกล่าว หรือเมื่อผู้ซื้อร้องขอตลอดเวลาระยะเวลารับประกันโดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๒.๒ ผู้ขายต้องให้คำแนะนำแก่ผู้ซื้อในการใช้โปรแกรมคอมพิวเตอร์และคู่มือการใช้โปรแกรมคอมพิวเตอร์ รวมทั้งจะต้องดำเนินการต่างๆ เกี่ยวกับโปรแกรมคอมพิวเตอร์ ในลักษณะของ\r\nการให้บริการหลังการขาย ทั้งนี้ เพื่อให้โปรแกรมคอมพิวเตอร์สามารถทำงานได้อย่างสมบูรณ์ ตลอดระยะเวลาการรับประกันตามข้อ ๙.๒ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ รายละเอียดเป็นไปตามที่กำหนดในเอกสาร      แนบท้ายสัญญาผนวก ๕ แนบท้ายสัญญานี้\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๓\tการรักษาความลับทางการค้า", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๓.๑ ผู้ซื้อจะไม่เปิดเผยในลักษณะที่จะก่อให้เกิดความเสียหายแก่ผู้ขาย ให้บุคคลอื่นทราบซึ่งข้อมูลหรือเทคนิคเกี่ยวกับโปรแกรมคอมพิวเตอร์ ซึ่งผู้ขายประสงค์ให้เป็นความลับทางการค้าของผู้ขาย และผู้ขายได้แจ้งให้ผู้ซื้อทราบเป็นหนังสือแล้ว", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("๑๓.๒ ผู้ขาย ลูกจ้าง ตัวแทนหรือพนักงานของผู้ขายจะต้องไม่เอาไป เปิดเผย หรือใช้ข้อมูลและ/หรือสารสนเทศของผู้ซื้อ หรือกระทำด้วยประการใดๆ ให้บุคคลอื่นเอาไป เปิดเผย หรือใช้ข้อมูล\r\nและ/หรือสารสนเทศของผู้ซื้อ หรือเข้าถึงโดยมิชอบซึ่งข้อมูลและ/หรือสารสนเทศของผู้ซื้อผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์ หรือล่วงรู้มาตรการป้องกันการเข้าถึงข้อมูลและ/หรือสารสนเทศของ         ผู้ซื้อผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์ที่จัดทำขึ้นเป็นการเฉพาะ หรือกระทำด้วยประการใดๆ โดยมิชอบด้วยวิธีการทางอิเล็กทรอนิกส์เพื่อดักรับไว้ซึ่งข้อมูลและ/หรือสารสนเทศของผู้ซื้อหรือผู้ที่เกี่ยวข้องกับผู้ซื้อที่อยู่ระหว่างการส่งผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์โดยไม่ชอบด้วยกฎหมาย          หรือโดยไม่ได้รับความยินยอมเป็นหนังสือจากผู้ซื้อ\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๔\tความคุ้มครองเกี่ยวกับลิขสิทธิ์", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่บุคคลภายนอกกล่าวอ้างหรือใช้สิทธิเรียกร้องใดๆ ว่ามีการละเมิดลิขสิทธิ์หรือสิทธิบัตรหรือสิทธิใดๆ เกี่ยวกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้ โดยผู้ซื้อมิได้แก้ไขดัดแปลงไปจากเดิม หรือแก้ไขดัดแปลงโดยได้รับความยินยอมจากผู้ขายเป็นหนังสือ หรือเป็นกรณีที่กฎหมายอนุญาตให้ทำได้ ผู้ขายจะต้องปกป้องผู้ซื้อและดำเนินการทั้งปวงเพื่อให้การกล่าวอ้างหรือการเรียกร้องดังกล่าวระงับสิ้นไปโดยเร็ว เพื่อให้ผู้ซื้อสามารถใช้โปรแกรมคอมพิวเตอร์นั้นต่อไปได้ ขั้นตอนดังกล่าวอาจรวมถึงการคืนโปรแกรมคอมพิวเตอร์เดิมและเปลี่ยนโปรแกรมคอมพิวเตอร์ที่มีคุณสมบัติไม่ต่ำกว่าโปรแกรมคอมพิวเตอร์เดิมให้ใหม่ ระยะเวลาที่เสียไปดังกล่าวไม่นับรวมเป็นระยะเวลาใช้สิทธิตามสัญญา หากผู้ขายไม่อาจกระทำได้ \r\nและผู้ซื้อต้องรับผิดชดใช้ค่าเสียหายต่อบุคคลภายนอก เนื่องจากผลแห่งการละเมิดลิขสิทธิ์ดังกล่าว ผู้ขายต้องเป็นผู้ชำระค่าเสียหาย ค่าปรับ และค่าใช้จ่ายอื่นๆ รวมทั้งค่าฤชาธรรมเนียมและค่าทนายความแทนผู้ซื้อ ทั้งนี้ ผู้ซื้อจะแจ้งให้ผู้ขายทราบเป็นหนังสือในเมื่อได้มีการกล่าวอ้างหรือใช้สิทธิเรียกร้องดังกล่าวโดยไม่ชักช้า\r\n", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๕\tโปรแกรมคอมพิวเตอร์ที่ได้รับการแก้ไขพัฒนาให้ดีขึ้น", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ผู้ขายมีหน้าที่ต้องเสนอโปรแกรมคอมพิวเตอร์ที่ได้รับการพัฒนาให้ทันสมัยเป็นปัจจุบันและดีขึ้นจากรากฐานโปรแกรมคอมพิวเตอร์ตามสัญญานี้ หรือจากรากฐานโปรแกรมคอมพิวเตอร์อื่นที่เกี่ยวพันกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้แก่ผู้ซื้อ และผู้ซื้อมีสิทธิใช้โปรแกรมคอมพิวเตอร์รุ่นที่พัฒนาทันสมัยเป็นปัจจุบันและดีขึ้นแล้วนี้ด้วย โดยผู้ซื้อไม่ต้องจ่ายค่าตอบแทนเพิ่มขึ้นและ/หรือจะต้องจ่ายค่าตอบแทน ให้ผู้ขายตามจำนวนที่จะตกลงกันตามเอกสารแนบท้ายสัญญาผนวก ๖", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การที่ผู้ซื้อเลือกที่จะใช้โปรแกรมคอมพิวเตอร์ที่ได้พัฒนาตามวรรคหนึ่งแล้ว ไม่มีผลกระทบต่อข้อสัญญาอื่นๆ", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๖\tการบอกเลิกสัญญา", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อครบกำหนดส่งมอบโปรแกรมคอมพิวเตอร์ตามข้อ ๕ แล้ว ถ้าผู้ขายไม่ส่งมอบโปรแกรมคอมพิวเตอร์ให้แก่ผู้ซื้อถูกต้องครบถ้วนภายในกำหนดเวลาดังกล่าว หรือส่งมอบโปรแกรมคอมพิวเตอร์ไม่ตรงตามรายละเอียดและคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก ๑ และผนวก ๒ และเงื่อนไขต่างๆ ของสัญญานี้ หรือส่งมอบภายในกำหนดแต่ใช้งานไม่ได้ครบถ้วนตามข้อ ๕ หรือผู้ขายผิดสัญญาข้อใดข้อหนึ่ง ผู้ซื้อมีสิทธิบอกเลิกสัญญาทั้งหมดหรือแต่บางส่วนได้การใช้สิทธิบอกเลิกสัญญานั้นไม่กระทบสิทธิของผู้ซื้อที่จะเรียกร้องค่าเสียหายจากผู้ขาย", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ซื้อใช้สิทธิบอกเลิกสัญญา ผู้ซื้อมีสิทธิริบหรือบังคับจากหลักประกันตามข้อ ๑๐ เป็นจำนวนเงินทั้งหมดหรือแต่บางส่วนก็ได้ แล้วแต่ผู้ซื้อจะเห็นสมควร ตลอดจนมีสิทธิเรียกค่าเสียหายใดๆ อันเนื่องมาจากผู้ขายไม่ปฏิบัติตามสัญญานี้ และถ้าผู้ซื้อจัดซื้อโปรแกรมคอมพิวเตอร์จากบุคคลอื่น เต็มจำนวนหรือเฉพาะจำนวนที่ขาดส่งแล้วแต่กรณีภายในกำหนด….…(19)…...(…………..…………..) เดือน นับถัดจากวันบอกเลิกสัญญา ผู้ขายจะต้องชดใช้ราคาที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานี้ด้วย", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๗\tค่าปรับ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ซื้อยังไม่ใช้สิทธิบอกเลิกสัญญาตามข้อ ๑๖ ผู้ขายจะต้องชำระค่าปรับให้    ผู้ซื้อเป็นรายวันในอัตราร้อยละ…..……(20)…..…...(….………………..………..) ของราคาโปรแกรมคอมพิวเตอร์\r\nที่ยังไม่ได้รับมอบ นับถัดจากวันครบกำหนดตามสัญญา จนถึงวันที่ผู้ขายได้นำโปรแกรมคอมพิวเตอร์มาส่งมอบให้แก่ผู้ซื้อจนถูกต้องครบถ้วน\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การคิดค่าปรับในกรณีผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ที่ตกลงซื้อขายและอนุญาตให้ใช้สิทธิเพียงบางส่วนหรือขาดส่วนประกอบส่วนใดส่วนหนึ่งไป หรือส่งมอบโปรแกรมคอมพิวเตอร์ทั้งหมด แต่ใช้งานไม่ได้ถูกต้องครบถ้วนตามข้อ ๕ ซึ่งส่งผลให้ระบบคอมพิวเตอร์ทั้งหมดใช้งานไม่ได้ ให้ถือว่ายังไม่ได้ส่งมอบโปรแกรมคอมพิวเตอร์นั้นเลย และให้คิดค่าปรับเป็นรายวันจากราคาโปรแกรมคอมพิวเตอร์ทั้งชุด", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในระหว่างที่ผู้ซื้อไม่ได้ใช้สิทธิบอกเลิกสัญญานั้น ถ้าผู้ซื้อเห็นว่าผู้ขายไม่อาจปฏิบัติ\r\nตามสัญญาต่อไปได้ ผู้ซื้อจะใช้สิทธิบอกเลิกสัญญาและริบหรือบังคับจากหลักประกันตามข้อ ๑๐ \r\nกับเรียกร้องให้ชดใช้ราคาที่เพิ่มขึ้นตามที่กำหนดไว้ในข้อ ๑๖ วรรคสอง ก็ได้ และถ้าผู้ซื้อได้แจ้งข้อเรียกร้องให้ชำระค่าปรับไปยังผู้ขายเมื่อครบกำหนดส่งมอบแล้ว ผู้ซื้อมีสิทธิที่จะปรับผู้ขายจนถึงวันบอกเลิกสัญญา\r\nได้อีกด้วย\r\n", null, "32"));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๑๘\tการบังคับค่าปรับ ค่าเสียหาย และค่าใช้จ่าย ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่ผู้ขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่งด้วยเหตุใดๆ ก็ตาม จนเป็นเหตุให้เกิดค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแก่ผู้ซื้อ ผู้ขายต้องชดใช้ค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายดังกล่าวให้แก่ผู้ซื้อโดยสิ้นเชิงภายในกำหนด………………….(…….……………...) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือ\r\nจากผู้ซื้อ หากผู้ขายไม่ชดใช้ให้ถูกต้องครบถ้วนภายในระยะเวลาดังกล่าว ให้ผู้ซื้อมีสิทธิที่จะหักเอาจากจำนวนเงินค่าโปรแกรมคอมพิวเตอร์ที่ต้องชำระ หรือบังคับจากหลักประกันการปฏิบัติตามสัญญาได้ทันที\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หากค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายที่บังคับจากเงินค่าโปรแกรมคอมพิวเตอร์ ที่ต้องชำระ หรือหลักประกันการปฏิบัติตามสัญญาแล้วยังไม่เพียงพอ ผู้ขายยินยอมชำระส่วนที่เหลือ ที่ยังขาดอยู่จนครบถ้วนตามจำนวนค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายนั้น ภายในกำหนด...........(............) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("หากมีเงินค่าโปรแกรมคอมพิวเตอร์ตามสัญญาที่หักไว้จ่ายเป็นค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแล้วยังเหลืออยู่อีกเท่าใด ผู้ซื้อจะคืนให้แก่ผู้ขายทั้งหมด", null, "32"));

            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(21) ข้อ ๑๙ การส่งคืนโปรแกรมคอมพิวเตอร์", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("เมื่อสัญญาสิ้นสุดลง ไม่ว่าจะในกรณีที่มีการเลิกสัญญา หรือกรณีครบกำหนดระยะเวลาการอนุญาตให้ใช้สิทธิ หากผู้ขายมีหนังสือร้องขอภายในกำหนดเวลา….…………..…......(…..……..…………..) วัน นับถัดจากวันที่สัญญาสิ้นสุดลง ผู้ซื้อจะส่งคืนโปรแกรมคอมพิวเตอร์และสำเนาโปรแกรมคอมพิวเตอร์\r\nตามสัญญานี้คืนให้กับผู้ขาย หากผู้ขายไม่ร้องขอภายในกำหนดเวลาดังกล่าว ให้ถือว่าสละสิทธิการรับคืนโปรแกรมคอมพิวเตอร์ตามสัญญานี้ \r\n", null, "32"));


            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("ข้อ ๒๐\tการงดหรือลดค่าปรับ หรือขยายเวลาส่งมอบ", null, "32", true));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่มีเหตุสุดวิสัย หรือเหตุใดๆ อันเนื่องมาจากความผิดหรือความบกพร่อง\r\nของฝ่ายผู้ซื้อ หรือจากพฤติการณ์อันหนึ่งอันใดที่ผู้ขายไม่ต้องรับผิดตามกฎหมาย หรือเหตุอื่นตามที่กำหนดในกฎกระทรวง ซึ่งออกตามความในกฎหมายว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ \r\nทำให้ผู้ขายไม่สามารถส่งมอบโปรแกรมคอมพิวเตอร์ตามเงื่อนไขและกำหนดเวลาแห่งสัญญานี้ได้ ผู้ขายมีสิทธิของดหรือลดค่าปรับหรือขยายเวลาตามสัญญาได้โดยจะต้องแจ้งเหตุหรือพฤติการณ์ดังกล่าวพร้อมหลักฐานเป็นหนังสือให้ผู้ซื้อทราบภายใน ๑๕ (สิบห้า) วัน นับถัดจากวันที่เหตุนั้นสิ้นสุดลง หรือตามที่กำหนด\r\nในกฎกระทรวงดังกล่าว แล้วแต่กรณี\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ถ้าผู้ขายไม่ปฏิบัติให้เป็นไปตามความในวรรคหนึ่ง ให้ถือว่าผู้ขายได้สละสิทธิเรียกร้อง\r\nในการที่จะของดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญา โดยไม่มีเงื่อนไขใดๆ ทั้งสิ้น เว้นแต่กรณี     เหตุเกิดจากความผิดหรือความบกพร่องของฝ่ายผู้ซื้อซึ่งมีหลักฐานชัดแจ้งหรือผู้ซื้อทราบดีอยู่แล้วตั้งแต่ต้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("การงดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญาตามวรรคหนึ่ง อยู่ในดุลพินิจของผู้ซื้อที่จะพิจารณาตามที่เห็นสมควร", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("สัญญานี้ทำขึ้นสองฉบับ มีข้อความถูกต้องตรงกัน คู่สัญญาได้อ่านและเข้าใจข้อความโดยละเอียดตลอดแล้ว จึงได้ลงลายมือชื่อพร้อมทั้งประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยาน และคู่สัญญาต่างยึดถือไว้ฝ่ายละหนึ่งฉบับ", null, "32"));



            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ.........................................................................ผู้ซื้อ"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(................................................................................)"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ........................................................................ผู้ขาย"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(................................................................................)"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ......................................................................พยาน"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(...............................................................................)"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("ลงชื่อ......................................................................พยาน"));
            body.AppendChild(WordServiceSetting.CenteredParagraph("(...............................................................................)"));

            // next page
            body.AppendChild(new Paragraph(new Run(new Break() { Type = BreakValues.Page })));
            body.AppendChild(WordServiceSetting.CenteredBoldColoredParagraph("วิธีปฏิบัติเกี่ยวกับสัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์", "000000", "36"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(1) \tให้ระบุเลขที่สัญญาในปีงบประมาณหนึ่งๆ ตามลำดับ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(2) \tให้ระบุชื่อของหน่วยงานของรัฐที่เป็นนิติบุคคล เช่น กรม ก. หรือรัฐวิสาหกิจ ข. เป็นต้น", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(3) \tให้ระบุชื่อและตำแหน่งของหัวหน้าหน่วยงานของรัฐที่เป็นนิติบุคคลนั้น หรือผู้ที่ได้รับ\r\nมอบอำนาจ เช่น นาย ก. อธิบดีกรม………...… หรือ นาย ข. ผู้ได้รับมอบอำนาจจากอธิบดีกรม………......………..\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(4) \tให้ระบุชื่อผู้ให้เช่า", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ก. กรณีนิติบุคคล เช่น ห้างหุ้นส่วนสามัญจดทะเบียน ห้างหุ้นส่วนจำกัด บริษัทจำกัด", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ข. กรณีบุคคลธรรมดา ให้ระบุชื่อและที่อยู่", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(5) \tเป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(6) \tเป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๗) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๘) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อ\r\nโดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ ๓ วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่\r\nไว้ตรวจรับของนั้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย \r\nและในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๙) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อ\r\nโดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ ๓ วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่\r\nไว้ตรวจรับของนั้น\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย \r\nและในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๑๐) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("๑๑) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(๑๒) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(13) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(14) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะ\r\nของสิ่งของที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(15) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะ\r\nของสิ่งของที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(16) “หลักประกัน” หมายถึง หลักประกันที่ผู้รับจ้างนำมามอบไว้แก่หน่วยงานของรัฐ\r\nเมื่อลงนามในสัญญาเพื่อประกันความเสียหายที่อาจเกิดขึ้นจากการปฏิบัติตามสัญญา ดังนี้\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๑)\tเงินสด ", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๒)\tเช็คหรือดราฟท์ที่ธนาคารเซ็นสั่งจ่าย ซึ่งเป็นเช็คหรือดราฟท์ลงวันที่ที่ใช้เช็คหรือ\r\nดราฟท์นั้นชำระต่อเจ้าหน้าที่ หรือก่อนวันนั้นไม่เกิน ๓ วันทำการ \r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๓)\tหนังสือคํ้าประกันของธนาคารภายในประเทศตามตัวอย่างที่คณะกรรมการนโยบายกําหนด โดยอาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๔)\tหนังสือค้ำประกันของบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาต\r\nให้ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคาร\r\nแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบ โดยอนุโลมให้ใช้ตามตัวอย่างหนังสือค้ำประกันของธนาคารที่คณะกรรมการนโยบายกําหนด\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_3Tabs("(๕)\tพันธบัตรรัฐบาลไทย", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(17) ให้กำหนดจำนวนเงินหลักประกันการปฏิบัติตามสัญญาตามระเบียบกระทรวงการคลัง\r\nว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๘ ทั้งนี้ จะต้องประกาศให้ทราบ\r\nในเอกสารประกวดราคาด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(18) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(19) กำหนดเวลาที่ผู้ซื้อจะซื้อสิ่งของจากแหล่งอื่นเมื่อบอกเลิกสัญญาและมีสิทธิเรียกเงิน\r\nในส่วนที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานั้น ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(20) อัตราค่าปรับตามสัญญาข้อ ๑๗ ให้กำหนดเป็นรายวันในอัตราตายตัวระหว่างร้อยละ \r\n๐.๐๑ – ๐.๒๐ ของราคาพัสดุที่ยังไม่ได้ส่งมอบ ตามระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้าง\r\nและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๒ ส่วนกรณีจะปรับร้อยละเท่าใด ให้อยู่ในดุลพินิจของหน่วยงานของรัฐผู้ซื้อที่จะพิจารณา โดยคำนึงถึงราคาและลักษณะของพัสดุที่ซื้อ ซึ่งอาจมีผลกระทบ\r\nต่อการที่ผู้ขายจะหลีกเลี่ยงไม่ปฏิบัติตามสัญญา แต่ทั้งนี้ การที่จะกำหนดค่าปรับเป็นร้อยละเท่าใดจะต้องกำหนดไว้ในเอกสารเชิญชวนด้วย\r\n", null, "32"));
            body.AppendChild(WordServiceSetting.NormalParagraphWith_2Tabs("(21) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง", null, "32"));




            body.AppendChild(WordServiceSetting.EmptyParagraph());




            WordServiceSetting.AddHeaderWithPageNumber(mainPart, body);

        }
        stream.Position = 0;
        return stream.ToArray();
    }
    #endregion 4.1.1.2.10.สัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ ร.308-60

}
